dcmwijaya/ESP_FC28_Library/ESP32_FC28.cpp
// Library: Soil Moisture FC-28
// By: Devan Cakra M.W

#include <ESP32_FC28.h>

void FC28Sensor::initFC28Sensor(int baudRate, int pin) {
  Serial.begin(baudRate);
  pinMode(pin, INPUT);
  _pin = pin;
}

float FC28Sensor::getSoilMoisture() {
  analogFC28 = analogRead(_pin);

  // Percentage Range: 99.1-100.0
  if (analogFC28 >= 4095) { return value = 100.0; } 
  else if (analogFC28 >= 4090.905 && analogFC28 < 4095) { return value = 99.9; }
  else if (analogFC28 >= 4086.81 && analogFC28 < 4090.905) { return value = 99.8; }
  else if (analogFC28 >= 4082.715 && analogFC28 < 4086.81) { return value = 99.7; }
  else if (analogFC28 >= 4078.62 && analogFC28 < 4082.715) { return value = 99.6; }
  else if (analogFC28 >= 4074.525 && analogFC28 < 4078.62) { return value = 99.5; }
  else if (analogFC28 >= 4070.43 && analogFC28 < 4074.525) { return value = 99.4; }
  else if (analogFC28 >= 4066.335 && analogFC28 < 4070.43) { return value = 99.3; }
  else if (analogFC28 >= 4062.24 && analogFC28 < 4066.335) { return value = 99.2; }
  else if (analogFC28 >= 4058.145 && analogFC28 < 4062.24) { return value = 99.1; }

  // Percentage Range: 98.1-99.0
  if (analogFC28 >= 4054.05 && analogFC28 < 4058.145) { return value = 99.0; } 
  else if (analogFC28 >= 4049.955 && analogFC28 < 4054.05) { return value = 98.9; }
  else if (analogFC28 >= 4045.86 && analogFC28 < 4049.955) { return value = 98.8; }
  else if (analogFC28 >= 4041.765 && analogFC28 < 4045.86) { return value = 98.7; }
  else if (analogFC28 >= 4037.67 && analogFC28 < 4041.765) { return value = 98.6; }
  else if (analogFC28 >= 4033.575 && analogFC28 < 4037.67) { return value = 98.5; }
  else if (analogFC28 >= 4029.48 && analogFC28 < 4033.575) { return value = 98.4; }
  else if (analogFC28 >= 4025.385 && analogFC28 < 4029.48) { return value = 98.3; }
  else if (analogFC28 >= 4021.29 && analogFC28 < 4025.385) { return value = 98.2; }
  else if (analogFC28 >= 4017.195 && analogFC28 < 4021.29) { return value = 98.1; }

  // Percentage Range: 97.1-98.0
  if (analogFC28 >= 4013.1 && analogFC28 < 4017.195) { return value = 98.0; } 
  else if (analogFC28 >= 4009.005 && analogFC28 < 4013.1) { return value = 97.9; }
  else if (analogFC28 >= 4004.91 && analogFC28 < 4009.005) { return value = 97.8; }
  else if (analogFC28 >= 4000.815 && analogFC28 < 4004.91) { return value = 97.7; }
  else if (analogFC28 >= 3996.72 && analogFC28 < 4000.815) { return value = 97.6; }
  else if (analogFC28 >= 3992.625 && analogFC28 < 3996.72) { return value = 97.5; }
  else if (analogFC28 >= 3988.53 && analogFC28 < 3992.625) { return value = 97.4; }
  else if (analogFC28 >= 3984.435 && analogFC28 < 3988.53) { return value = 97.3; }
  else if (analogFC28 >= 3980.34 && analogFC28 < 3984.435) { return value = 97.2; }
  else if (analogFC28 >= 3976.245 && analogFC28 < 3980.34) { return value = 97.1; }

  // Percentage Range: 96.1-97.0
  if (analogFC28 >= 3972.15 && analogFC28 < 3976.245) { return value = 97.0; } 
  else if (analogFC28 >= 3968.055 && analogFC28 < 3972.15) { return value = 96.9; }
  else if (analogFC28 >= 3963.96 && analogFC28 < 3968.055) { return value = 96.8; }
  else if (analogFC28 >= 3959.865 && analogFC28 < 3963.96) { return value = 96.7; }
  else if (analogFC28 >= 3955.77 && analogFC28 < 3959.865) { return value = 96.6; }
  else if (analogFC28 >= 3951.675 && analogFC28 < 3955.77) { return value = 96.5; }
  else if (analogFC28 >= 3947.58 && analogFC28 < 3951.675) { return value = 96.4; }
  else if (analogFC28 >= 3943.485 && analogFC28 < 3947.58) { return value = 96.3; }
  else if (analogFC28 >= 3939.39 && analogFC28 < 3943.485) { return value = 96.2; }
  else if (analogFC28 >= 3935.295 && analogFC28 < 3939.39) { return value = 96.1; }

  // Percentage Range: 95.1-96.0
  if (analogFC28 >= 3931.2 && analogFC28 < 3935.295) { return value = 96.0; } 
  else if (analogFC28 >= 3927.105 && analogFC28 < 3931.2) { return value = 95.9; }
  else if (analogFC28 >= 3923.01 && analogFC28 < 3927.105) { return value = 95.8; }
  else if (analogFC28 >= 3918.915 && analogFC28 < 3923.01) { return value = 95.7; }
  else if (analogFC28 >= 3914.82 && analogFC28 < 3918.915) { return value = 95.6; }
  else if (analogFC28 >= 3910.725 && analogFC28 < 3914.82) { return value = 95.5; }
  else if (analogFC28 >= 3906.63 && analogFC28 < 3910.725) { return value = 95.4; }
  else if (analogFC28 >= 3902.535 && analogFC28 < 3906.63) { return value = 95.3; }
  else if (analogFC28 >= 3898.44 && analogFC28 < 3902.535) { return value = 95.2; }
  else if (analogFC28 >= 3894.345 && analogFC28 < 3898.44) { return value = 95.1; }

  // Percentage Range: 94.1-95.0
  if (analogFC28 >= 3890.25 && analogFC28 < 3894.345) { return value = 95.0; } 
  else if (analogFC28 >= 3886.155 && analogFC28 < 3890.25) { return value = 94.9; }
  else if (analogFC28 >= 3882.06 && analogFC28 < 3886.155) { return value = 94.8; }
  else if (analogFC28 >= 3877.965 && analogFC28 < 3882.06) { return value = 94.7; }
  else if (analogFC28 >= 3873.87 && analogFC28 < 3877.965) { return value = 94.6; }
  else if (analogFC28 >= 3869.775 && analogFC28 < 3873.87) { return value = 94.5; }
  else if (analogFC28 >= 3865.68 && analogFC28 < 3869.775) { return value = 94.4; }
  else if (analogFC28 >= 3861.585 && analogFC28 < 3865.68) { return value = 94.3; }
  else if (analogFC28 >= 3857.49 && analogFC28 < 3861.585) { return value = 94.2; }
  else if (analogFC28 >= 3853.395 && analogFC28 < 3857.49) { return value = 94.1; }

  // Percentage Range: 93.1-94.0
  if (analogFC28 >= 3849.3 && analogFC28 < 3853.395) { return value = 94.0; } 
  else if (analogFC28 >= 3845.205 && analogFC28 < 3849.3) { return value = 93.9; }
  else if (analogFC28 >= 3841.11 && analogFC28 < 3845.205) { return value = 93.8; }
  else if (analogFC28 >= 3837.015 && analogFC28 < 3841.11) { return value = 93.7; }
  else if (analogFC28 >= 3832.92 && analogFC28 < 3837.015) { return value = 93.6; }
  else if (analogFC28 >= 3828.825 && analogFC28 < 3832.92) { return value = 93.5; }
  else if (analogFC28 >= 3824.73 && analogFC28 < 3828.825) { return value = 93.4; }
  else if (analogFC28 >= 3820.635 && analogFC28 < 3824.73) { return value = 93.3; }
  else if (analogFC28 >= 3816.54 && analogFC28 < 3820.635) { return value = 93.2; }
  else if (analogFC28 >= 3812.445 && analogFC28 < 3816.54) { return value = 93.1; }

  // Percentage Range: 92.1-93.0
  if (analogFC28 >= 3808.35 && analogFC28 < 3812.445) { return value = 93.0; } 
  else if (analogFC28 >= 3804.255 && analogFC28 < 3808.35) { return value = 92.9; }
  else if (analogFC28 >= 3800.16 && analogFC28 < 3804.255) { return value = 92.8; }
  else if (analogFC28 >= 3796.065 && analogFC28 < 3800.16) { return value = 92.7; }
  else if (analogFC28 >= 3791.97 && analogFC28 < 3796.065) { return value = 92.6; }
  else if (analogFC28 >= 3787.875 && analogFC28 < 3791.97) { return value = 92.5; }
  else if (analogFC28 >= 3783.78 && analogFC28 < 3787.875) { return value = 92.4; }
  else if (analogFC28 >= 3779.685 && analogFC28 < 3783.78) { return value = 92.3; }
  else if (analogFC28 >= 3775.59 && analogFC28 < 3779.685) { return value = 92.2; }
  else if (analogFC28 >= 3771.495 && analogFC28 < 3775.59) { return value = 92.1; }

  // Percentage Range: 91.1-92.0
  if (analogFC28 >= 3767.4 && analogFC28 < 3771.495) { return value = 92.0; } 
  else if (analogFC28 >= 3763.305 && analogFC28 < 3767.4) { return value = 91.9; }
  else if (analogFC28 >= 3759.21 && analogFC28 < 3763.305) { return value = 91.8; }
  else if (analogFC28 >= 3755.115 && analogFC28 < 3759.21) { return value = 91.7; }
  else if (analogFC28 >= 3751.02 && analogFC28 < 3755.115) { return value = 91.6; }
  else if (analogFC28 >= 3746.925 && analogFC28 < 3751.02) { return value = 91.5; }
  else if (analogFC28 >= 3742.83 && analogFC28 < 3746.925) { return value = 91.4; }
  else if (analogFC28 >= 3788.735 && analogFC28 < 3742.83) { return value = 91.3; }
  else if (analogFC28 >= 3734.64 && analogFC28 < 3788.735) { return value = 91.2; }
  else if (analogFC28 >= 3730.545 && analogFC28 < 3734.64) { return value = 91.1; }

  // Percentage Range: 90.1-91.0
  if (analogFC28 >= 3726.45 && analogFC28 < 3730.545) { return value = 91.0; } 
  else if (analogFC28 >= 3722.355 && analogFC28 < 3726.45) { return value = 90.9; }
  else if (analogFC28 >= 3718.26 && analogFC28 < 3722.355) { return value = 90.8; }
  else if (analogFC28 >= 3714.165 && analogFC28 < 3718.26) { return value = 90.7; }
  else if (analogFC28 >= 3710.07 && analogFC28 < 3714.165) { return value = 90.6; }
  else if (analogFC28 >= 3705.975 && analogFC28 < 3710.07) { return value = 90.5; }
  else if (analogFC28 >= 3701.88 && analogFC28 < 3705.975) { return value = 90.4; }
  else if (analogFC28 >= 3697.785 && analogFC28 < 3701.88) { return value = 90.3; }
  else if (analogFC28 >= 3693.69 && analogFC28 < 3697.785) { return value = 90.2; }
  else if (analogFC28 >= 3689.595 && analogFC28 < 3693.69) { return value = 90.1; }

  // Percentage Range: 89.1-90.0
  if (analogFC28 >= 3685.5 && analogFC28 < 3689.595) { return value = 90.0; } 
  else if (analogFC28 >= 3681.405 && analogFC28 < 3685.5) { return value = 89.9; }
  else if (analogFC28 >= 3677.31 && analogFC28 < 3681.405) { return value = 89.8; }
  else if (analogFC28 >= 3673.215 && analogFC28 < 3677.31) { return value = 89.7; }
  else if (analogFC28 >= 3669.12 && analogFC28 < 3673.215) { return value = 89.6; }
  else if (analogFC28 >= 3665.025 && analogFC28 < 3669.12) { return value = 89.5; }
  else if (analogFC28 >= 3660.93 && analogFC28 < 3665.025) { return value = 89.4; }
  else if (analogFC28 >= 3656.835 && analogFC28 < 3660.93) { return value = 89.3; }
  else if (analogFC28 >= 3652.74 && analogFC28 < 3656.835) { return value = 89.2; }
  else if (analogFC28 >= 3648.645 && analogFC28 < 3652.74) { return value = 89.1; }

  // Percentage Range: 88.1-89.0
  if (analogFC28 >= 3644.55 && analogFC28 < 3648.645) { return value = 89.0; } 
  else if (analogFC28 >= 3640.455 && analogFC28 < 3644.55) { return value = 88.9; }
  else if (analogFC28 >= 3636.36 && analogFC28 < 3640.455) { return value = 88.8; }
  else if (analogFC28 >= 3632.265 && analogFC28 < 3636.36) { return value = 88.7; }
  else if (analogFC28 >= 3628.17 && analogFC28 < 3632.265) { return value = 88.6; }
  else if (analogFC28 >= 3624.075 && analogFC28 < 3628.17) { return value = 88.5; }
  else if (analogFC28 >= 3619.98 && analogFC28 < 3624.075) { return value = 88.4; }
  else if (analogFC28 >= 3615.885 && analogFC28 < 3619.98) { return value = 88.3; }
  else if (analogFC28 >= 3611.79 && analogFC28 < 3615.885) { return value = 88.2; }
  else if (analogFC28 >= 3607.695 && analogFC28 < 3611.79) { return value = 88.1; }

  // Percentage Range: 87.1-88.0
  if (analogFC28 >= 3603.6 && analogFC28 < 3607.695) { return value = 88.0; } 
  else if (analogFC28 >= 3599.505 && analogFC28 < 3603.6) { return value = 87.9; }
  else if (analogFC28 >= 3595.41 && analogFC28 < 3599.505) { return value = 87.8; }
  else if (analogFC28 >= 3591.315 && analogFC28 < 3595.41) { return value = 87.7; }
  else if (analogFC28 >= 3587.22 && analogFC28 < 3591.315) { return value = 87.6; }
  else if (analogFC28 >= 3583.125 && analogFC28 < 3587.22) { return value = 87.5; }
  else if (analogFC28 >= 3579.03 && analogFC28 < 3583.125) { return value = 87.4; }
  else if (analogFC28 >= 3574.935 && analogFC28 < 3579.03) { return value = 87.3; }
  else if (analogFC28 >= 3570.84 && analogFC28 < 3574.935) { return value = 87.2; }
  else if (analogFC28 >= 3566.745 && analogFC28 < 3570.84) { return value = 87.1; }

  // Percentage Range: 86.1-87.0
  if (analogFC28 >= 3562.65 && analogFC28 < 3566.745) { return value = 87.0; } 
  else if (analogFC28 >= 3558.555 && analogFC28 < 3562.65) { return value = 86.9; }
  else if (analogFC28 >= 3554.46 && analogFC28 < 3558.555) { return value = 86.8; }
  else if (analogFC28 >= 3550.365 && analogFC28 < 3554.46) { return value = 86.7; }
  else if (analogFC28 >= 3546.27 && analogFC28 < 3550.365) { return value = 86.6; }
  else if (analogFC28 >= 3542.175 && analogFC28 < 3546.27) { return value = 86.5; }
  else if (analogFC28 >= 3538.08 && analogFC28 < 3542.175) { return value = 86.4; }
  else if (analogFC28 >= 3533.985 && analogFC28 < 3538.08) { return value = 86.3; }
  else if (analogFC28 >= 3529.89 && analogFC28 < 3533.985) { return value = 86.2; }
  else if (analogFC28 >= 3525.795 && analogFC28 < 3529.89) { return value = 86.1; }

  // Percentage Range: 85.1-86.0
  if (analogFC28 >= 3521.7 && analogFC28 < 3525.795) { return value = 86.0; } 
  else if (analogFC28 >= 3517.605 && analogFC28 < 3521.7) { return value = 85.9; }
  else if (analogFC28 >= 3513.51 && analogFC28 < 3517.605) { return value = 85.8; }
  else if (analogFC28 >= 3509.415 && analogFC28 < 3513.51) { return value = 85.7; }
  else if (analogFC28 >= 3505.32 && analogFC28 < 3509.415) { return value = 85.6; }
  else if (analogFC28 >= 3501.225 && analogFC28 < 3505.32) { return value = 85.5; }
  else if (analogFC28 >= 3497.13 && analogFC28 < 3501.225) { return value = 85.4; }
  else if (analogFC28 >= 3493.035 && analogFC28 < 3497.13) { return value = 85.3; }
  else if (analogFC28 >= 3488.94 && analogFC28 < 3493.035) { return value = 85.2; }
  else if (analogFC28 >= 3484.845 && analogFC28 < 3488.94) { return value = 85.1; }

  // Percentage Range: 84.1-85.0
  if (analogFC28 >= 3480.75 && analogFC28 < 3484.845) { return value = 85.0; } 
  else if (analogFC28 >= 3476.655 && analogFC28 < 3480.75) { return value = 84.9; }
  else if (analogFC28 >= 3472.56 && analogFC28 < 3476.655) { return value = 84.8; }
  else if (analogFC28 >= 3468.465 && analogFC28 < 3472.56) { return value = 84.7; }
  else if (analogFC28 >= 3464.37 && analogFC28 < 3468.465) { return value = 84.6; }
  else if (analogFC28 >= 3460.275 && analogFC28 < 3464.37) { return value = 84.5; }
  else if (analogFC28 >= 3456.18 && analogFC28 < 3460.275) { return value = 84.4; }
  else if (analogFC28 >= 3452.085 && analogFC28 < 3456.18) { return value = 84.3; }
  else if (analogFC28 >= 3447.99 && analogFC28 < 3452.085) { return value = 84.2; }
  else if (analogFC28 >= 3443.895 && analogFC28 < 3447.99) { return value = 84.1; }

  // Percentage Range: 83.1-84.0
  if (analogFC28 >= 3439.8 && analogFC28 < 3443.895) { return value = 84.0; } 
  else if (analogFC28 >= 3435.705 && analogFC28 < 3439.8) { return value = 83.9; }
  else if (analogFC28 >= 3431.61 && analogFC28 < 3435.705) { return value = 83.8; }
  else if (analogFC28 >= 3427.515 && analogFC28 < 3431.61) { return value = 83.7; }
  else if (analogFC28 >= 3423.42 && analogFC28 < 3427.515) { return value = 83.6; }
  else if (analogFC28 >= 3419.325 && analogFC28 < 3423.42) { return value = 83.5; }
  else if (analogFC28 >= 3415.23 && analogFC28 < 3419.325) { return value = 83.4; }
  else if (analogFC28 >= 3411.135 && analogFC28 < 3415.23) { return value = 83.3; }
  else if (analogFC28 >= 3407.04 && analogFC28 < 3411.135) { return value = 83.2; }
  else if (analogFC28 >= 3402.945 && analogFC28 < 3407.04) { return value = 83.1; }

