dcmwijaya/ESP_FC28_Library/ESP32_FC28.cpp
  // Percentage Range: 82.1-83.0
  if (analogFC28 >= 3398.85 && analogFC28 < 3402.945) { return value = 83.0; } 
  else if (analogFC28 >= 3394.755 && analogFC28 < 3398.85) { return value = 82.9; }
  else if (analogFC28 >= 3390.66 && analogFC28 < 3394.755) { return value = 82.8; }
  else if (analogFC28 >= 3386.565 && analogFC28 < 3390.66) { return value = 82.7; }
  else if (analogFC28 >= 3382.47 && analogFC28 < 3386.565) { return value = 82.6; }
  else if (analogFC28 >= 3378.375 && analogFC28 < 3382.47) { return value = 82.5; }
  else if (analogFC28 >= 3374.28 && analogFC28 < 3378.375) { return value = 82.4; }
  else if (analogFC28 >= 3370.185 && analogFC28 < 3374.28) { return value = 82.3; }
  else if (analogFC28 >= 3366.09 && analogFC28 < 3370.185) { return value = 82.2; }
  else if (analogFC28 >= 3361.995 && analogFC28 < 3366.09) { return value = 82.1; }

  // Percentage Range: 81.1-82.0
  if (analogFC28 >= 3357.9 && analogFC28 < 3361.995) { return value = 82.0; } 
  else if (analogFC28 >= 3353.805 && analogFC28 < 3357.9) { return value = 81.9; }
  else if (analogFC28 >= 3349.71 && analogFC28 < 3353.805) { return value = 81.8; }
  else if (analogFC28 >= 3345.615 && analogFC28 < 3349.71) { return value = 81.7; }
  else if (analogFC28 >= 3341.52 && analogFC28 < 3345.615) { return value = 81.6; }
  else if (analogFC28 >= 3337.425 && analogFC28 < 3341.52) { return value = 81.5; }
  else if (analogFC28 >= 3333.33 && analogFC28 < 3337.425) { return value = 81.4; }
  else if (analogFC28 >= 3329.235 && analogFC28 < 3333.33) { return value = 81.3; }
  else if (analogFC28 >= 3325.14 && analogFC28 < 3329.235) { return value = 81.2; }
  else if (analogFC28 >= 3321.045 && analogFC28 < 3325.14) { return value = 81.1; }
  
  // Percentage Range: 80.1-81.0
  if (analogFC28 >= 3316.95 && analogFC28 < 3321.045) { return value = 81.0; } 
  else if (analogFC28 >= 3312.855 && analogFC28 < 3316.95) { return value = 80.9; }
  else if (analogFC28 >= 3308.76 && analogFC28 < 3312.855) { return value = 80.8; }
  else if (analogFC28 >= 3304.665 && analogFC28 < 3308.76) { return value = 80.7; }
  else if (analogFC28 >= 3300.57 && analogFC28 < 3304.665) { return value = 80.6; }
  else if (analogFC28 >= 3296.475 && analogFC28 < 3300.57) { return value = 80.5; }
  else if (analogFC28 >= 3292.38 && analogFC28 < 3296.475) { return value = 80.4; }
  else if (analogFC28 >= 3288.285 && analogFC28 < 3292.38) { return value = 80.3; }
  else if (analogFC28 >= 3284.19 && analogFC28 < 3288.285) { return value = 80.2; }
  else if (analogFC28 >= 3280.095 && analogFC28 < 3284.19) { return value = 80.1; }

  // Percentage Range: 79.1-80.0
  if (analogFC28 >= 3276 && analogFC28 < 3280.095) { return value = 80.0; } 
  else if (analogFC28 >= 3271.905 && analogFC28 < 3276) { return value = 79.9; }
  else if (analogFC28 >= 3267.81 && analogFC28 < 3271.905) { return value = 79.8; }
  else if (analogFC28 >= 3263.715 && analogFC28 < 3267.81) { return value = 79.7; }
  else if (analogFC28 >= 3259.62 && analogFC28 < 3263.715) { return value = 79.6; }
  else if (analogFC28 >= 3255.525 && analogFC28 < 3259.62) { return value = 79.5; }
  else if (analogFC28 >= 3251.43 && analogFC28 < 3255.525) { return value = 79.4; }
  else if (analogFC28 >= 3247.335 && analogFC28 < 3251.43) { return value = 79.3; }
  else if (analogFC28 >= 3243.24 && analogFC28 < 3247.335) { return value = 79.2; }
  else if (analogFC28 >= 3239.145 && analogFC28 < 3243.24) { return value = 79.1; }

  // Percentage Range: 78.1-79.0
  if (analogFC28 >= 3235.05 && analogFC28 < 3239.145) { return value = 79.0; } 
  else if (analogFC28 >= 3230.955 && analogFC28 < 3235.05) { return value = 78.9; }
  else if (analogFC28 >= 3226.86 && analogFC28 < 3230.955) { return value = 78.8; }
  else if (analogFC28 >= 3222.765 && analogFC28 < 3226.86) { return value = 78.7; }
  else if (analogFC28 >= 3218.67 && analogFC28 < 3222.765) { return value = 78.6; }
  else if (analogFC28 >= 3214.575 && analogFC28 < 3218.67) { return value = 78.5; }
  else if (analogFC28 >= 3210.48 && analogFC28 < 3214.575) { return value = 78.4; }
  else if (analogFC28 >= 3206.385 && analogFC28 < 3210.48) { return value = 78.3; }
  else if (analogFC28 >= 3202.29 && analogFC28 < 3206.385) { return value = 78.2; }
  else if (analogFC28 >= 3198.195 && analogFC28 < 3202.29) { return value = 78.1; }

  // Percentage Range: 77.1-78.0
  if (analogFC28 >= 3194.1 && analogFC28 < 3198.195) { return value = 78.0; } 
  else if (analogFC28 >= 3190.005 && analogFC28 < 3194.1) { return value = 77.9; }
  else if (analogFC28 >= 3185.91 && analogFC28 < 3190.005) { return value = 77.8; }
  else if (analogFC28 >= 3181.815 && analogFC28 < 3185.91) { return value = 77.7; }
  else if (analogFC28 >= 3177.72 && analogFC28 < 3181.815) { return value = 77.6; }
  else if (analogFC28 >= 3173.625 && analogFC28 < 3177.72) { return value = 77.5; }
  else if (analogFC28 >= 3169.53 && analogFC28 < 3173.625) { return value = 77.4; }
  else if (analogFC28 >= 3165.435 && analogFC28 < 3169.53) { return value = 77.3; }
  else if (analogFC28 >= 3161.34 && analogFC28 < 3165.435) { return value = 77.2; }
  else if (analogFC28 >= 3157.245 && analogFC28 < 3161.34) { return value = 77.1; }

  // Percentage Range: 76.1-77.0
  if (analogFC28 >= 3153.15 && analogFC28 < 3157.245) { return value = 77.0; } 
  else if (analogFC28 >= 3149.055 && analogFC28 < 3153.15) { return value = 76.9; }
  else if (analogFC28 >= 3144.96 && analogFC28 < 3149.055) { return value = 76.8; }
  else if (analogFC28 >= 3140.865 && analogFC28 < 3144.96) { return value = 76.7; }
  else if (analogFC28 >= 3136.77 && analogFC28 < 3140.865) { return value = 76.6; }
  else if (analogFC28 >= 3132.675 && analogFC28 < 3136.77) { return value = 76.5; }
  else if (analogFC28 >= 3128.58 && analogFC28 < 3132.675) { return value = 76.4; }
  else if (analogFC28 >= 3124.485 && analogFC28 < 3128.58) { return value = 76.3; }
  else if (analogFC28 >= 3120.39 && analogFC28 < 3124.485) { return value = 76.2; }
  else if (analogFC28 >= 3116.295 && analogFC28 < 3120.39) { return value = 76.1; }

  // Percentage Range: 75.1-76.0
  if (analogFC28 >= 3112.2 && analogFC28 < 3116.295) { return value = 76.0; } 
  else if (analogFC28 >= 3108.105 && analogFC28 < 3112.2) { return value = 75.9; }
  else if (analogFC28 >= 3104.01 && analogFC28 < 3108.105) { return value = 75.8; }
  else if (analogFC28 >= 3099.915 && analogFC28 < 3104.01) { return value = 75.7; }
  else if (analogFC28 >= 3095.82 && analogFC28 < 3099.915) { return value = 75.6; }
  else if (analogFC28 >= 3091.725 && analogFC28 < 3095.82) { return value = 75.5; }
  else if (analogFC28 >= 3087.63 && analogFC28 < 3091.725) { return value = 75.4; }
  else if (analogFC28 >= 3083.535 && analogFC28 < 3087.63) { return value = 75.3; }
  else if (analogFC28 >= 3079.44 && analogFC28 < 3083.535) { return value = 75.2; }
  else if (analogFC28 >= 3075.345 && analogFC28 < 3079.44) { return value = 75.1; }

  // Percentage Range: 74.1-75.0
  if (analogFC28 >= 3071.25 && analogFC28 < 3075.345) { return value = 75.0; }
  else if (analogFC28 >= 3067.155 && analogFC28 < 3071.25) { return value = 74.9; }
  else if (analogFC28 >= 3063.06 && analogFC28 < 3067.155) { return value = 74.8; }
  else if (analogFC28 >= 3058.965 && analogFC28 < 3063.06) { return value = 74.7; }
  else if (analogFC28 >= 3054.87 && analogFC28 < 3058.965) { return value = 74.6; }
  else if (analogFC28 >= 3050.775 && analogFC28 < 3054.87) { return value = 74.5; }
  else if (analogFC28 >= 3046.68 && analogFC28 < 3050.775) { return value = 74.4; }
  else if (analogFC28 >= 3042.585 && analogFC28 < 3046.68) { return value = 74.3; }
  else if (analogFC28 >= 3038.49 && analogFC28 < 3042.585) { return value = 74.2; }
  else if (analogFC28 >= 3034.395 && analogFC28 < 3038.49) { return value = 74.1; }

