dcmwijaya/ESP_FC28_Library/ESP32_FC28.cpp
  // Percentage Range: 73.1-74.0
  if (analogFC28 >= 3030.3 && analogFC28 < 3034.395) { return value = 74.0; } 
  else if (analogFC28 >= 3026.205 && analogFC28 < 3030.3) { return value = 73.9; }
  else if (analogFC28 >= 3022.11 && analogFC28 < 3026.205) { return value = 73.8; }
  else if (analogFC28 >= 3018.015 && analogFC28 < 3022.11) { return value = 73.7; }
  else if (analogFC28 >= 3013.92 && analogFC28 < 3018.015) { return value = 73.6; }
  else if (analogFC28 >= 3009.825 && analogFC28 < 3013.92) { return value = 73.5; }
  else if (analogFC28 >= 3005.73 && analogFC28 < 3009.825) { return value = 73.4; }
  else if (analogFC28 >= 3001.635 && analogFC28 < 3005.73) { return value = 73.3; }
  else if (analogFC28 >= 2997.54 && analogFC28 < 3001.635) { return value = 73.2; }
  else if (analogFC28 >= 2993.445 && analogFC28 < 2997.54) { return value = 73.1; }

  // Percentage Range: 72.1-73.0
  if (analogFC28 >= 2989.35 && analogFC28 < 2993.445) { return value = 73.0; } 
  else if (analogFC28 >= 2985.255 && analogFC28 < 2989.35) { return value = 72.9; }
  else if (analogFC28 >= 2981.16 && analogFC28 < 2985.255) { return value = 72.8; }
  else if (analogFC28 >= 2977.065 && analogFC28 < 2981.16) { return value = 72.7; }
  else if (analogFC28 >= 2972.97 && analogFC28 < 2977.065) { return value = 72.6; }
  else if (analogFC28 >= 2968.875 && analogFC28 < 2972.97) { return value = 72.5; }
  else if (analogFC28 >= 2964.78 && analogFC28 < 2968.875) { return value = 72.4; }
  else if (analogFC28 >= 2960.685 && analogFC28 < 2964.78) { return value = 72.3; }
  else if (analogFC28 >= 2956.59 && analogFC28 < 2960.685) { return value = 72.2; }
  else if (analogFC28 >= 2952.495 && analogFC28 < 2956.59) { return value = 72.1; }

  // Percentage Range: 71.1-72.0
  if (analogFC28 >= 2948.4 && analogFC28 < 2952.495) { return value = 72.0; } 
  else if (analogFC28 >= 2944.305 && analogFC28 < 2948.4) { return value = 71.9; }
  else if (analogFC28 >= 2940.21 && analogFC28 < 2944.305) { return value = 71.8; }
  else if (analogFC28 >= 2936.115 && analogFC28 < 2940.21) { return value = 71.7; }
  else if (analogFC28 >= 2932.02 && analogFC28 < 2936.115) { return value = 71.6; }
  else if (analogFC28 >= 2927.925 && analogFC28 < 2932.02) { return value = 71.5; }
  else if (analogFC28 >= 2923.83 && analogFC28 < 2927.925) { return value = 71.4; }
  else if (analogFC28 >= 2919.735 && analogFC28 < 2923.83) { return value = 71.3; }
  else if (analogFC28 >= 2915.64 && analogFC28 < 2919.735) { return value = 71.2; }
  else if (analogFC28 >= 2911.545 && analogFC28 < 2915.64) { return value = 71.1; }

  // Percentage Range: 70.1-71.0
  if (analogFC28 >= 2907.45 && analogFC28 < 2911.545) { return value = 71.0; } 
  else if (analogFC28 >= 2903.355 && analogFC28 < 2907.45) { return value = 70.9; }
  else if (analogFC28 >= 2899.26 && analogFC28 < 2903.355) { return value = 70.8; }
  else if (analogFC28 >= 2895.165 && analogFC28 < 2899.26) { return value = 70.7; }
  else if (analogFC28 >= 2891.07 && analogFC28 < 2895.165) { return value = 70.6; }
  else if (analogFC28 >= 2886.975 && analogFC28 < 2891.07) { return value = 70.5; }
  else if (analogFC28 >= 2882.88 && analogFC28 < 2886.975) { return value = 70.4; }
  else if (analogFC28 >= 2878.785 && analogFC28 < 2882.88) { return value = 70.3; }
  else if (analogFC28 >= 2874.69 && analogFC28 < 2878.785) { return value = 70.2; }
  else if (analogFC28 >= 2870.595 && analogFC28 < 2874.69) { return value = 70.1; }

  // Percentage Range: 69.1-70.0
  if (analogFC28 >= 2866.5 && analogFC28 < 2870.595) { return value = 70.0; } 
  else if (analogFC28 >= 2862.405 && analogFC28 < 2866.5) { return value = 69.9; }
  else if (analogFC28 >= 2858.31 && analogFC28 < 2862.405) { return value = 69.8; }
  else if (analogFC28 >= 2854.215 && analogFC28 < 2858.31) { return value = 69.7; }
  else if (analogFC28 >= 2850.12 && analogFC28 < 2854.215) { return value = 69.6; }
  else if (analogFC28 >= 2846.025 && analogFC28 < 2850.12) { return value = 69.5; }
  else if (analogFC28 >= 2841.93 && analogFC28 < 2846.025) { return value = 69.4; }
  else if (analogFC28 >= 2837.835 && analogFC28 < 2841.93) { return value = 69.3; }
  else if (analogFC28 >= 2833.74 && analogFC28 < 2837.835) { return value = 69.2; }
  else if (analogFC28 >= 2829.645 && analogFC28 < 2833.74) { return value = 69.1; }

  // Percentage Range: 68.1-69.0
  if (analogFC28 >= 2825.55 && analogFC28 < 2829.645) { return value = 69.0; } 
  else if (analogFC28 >= 2821.455 && analogFC28 < 2825.55) { return value = 68.9; }
  else if (analogFC28 >= 2817.36 && analogFC28 < 2821.455) { return value = 68.8; }
  else if (analogFC28 >= 2813.265 && analogFC28 < 2817.36) { return value = 68.7; }
  else if (analogFC28 >= 2809.17 && analogFC28 < 2813.265) { return value = 68.6; }
  else if (analogFC28 >= 2805.075 && analogFC28 < 2809.17) { return value = 68.5; }
  else if (analogFC28 >= 2800.98 && analogFC28 < 2805.075) { return value = 68.4; }
  else if (analogFC28 >= 2796.885 && analogFC28 < 2800.98) { return value = 68.3; }
  else if (analogFC28 >= 2792.79 && analogFC28 < 2796.885) { return value = 68.2; }
  else if (analogFC28 >= 2788.695 && analogFC28 < 2792.79) { return value = 68.1; }

  // Percentage Range: 67.1-68.0
  if (analogFC28 >= 2784.6 && analogFC28 < 2788.695) { return value = 68.0; } 
  else if (analogFC28 >= 2780.505 && analogFC28 < 2784.6) { return value = 67.9; }
  else if (analogFC28 >= 2776.41 && analogFC28 < 2780.505) { return value = 67.8; }
  else if (analogFC28 >= 2772.315 && analogFC28 < 2776.41) { return value = 67.7; }
  else if (analogFC28 >= 2768.22 && analogFC28 < 2772.315) { return value = 67.6; }
  else if (analogFC28 >= 2764.125 && analogFC28 < 2768.22) { return value = 67.5; }
  else if (analogFC28 >= 2760.03 && analogFC28 < 2764.125) { return value = 67.4; }
  else if (analogFC28 >= 2755.935 && analogFC28 < 2760.03) { return value = 67.3; }
  else if (analogFC28 >= 2751.84 && analogFC28 < 2755.935) { return value = 67.2; }
  else if (analogFC28 >= 2747.745 && analogFC28 < 2751.84) { return value = 67.1; }

  // Percentage Range: 66.1-67.0
  if (analogFC28 >= 2743.65 && analogFC28 < 2747.745) { return value = 67.0; } 
  else if (analogFC28 >= 2739.555 && analogFC28 < 2743.65) { return value = 66.9; }
  else if (analogFC28 >= 2735.46 && analogFC28 < 2739.555) { return value = 66.8; }
  else if (analogFC28 >= 2731.365 && analogFC28 < 2735.46) { return value = 66.7; }
  else if (analogFC28 >= 2727.27 && analogFC28 < 2731.365) { return value = 66.6; }
  else if (analogFC28 >= 2723.175 && analogFC28 < 2727.27) { return value = 66.5; }
  else if (analogFC28 >= 2719.08 && analogFC28 < 2723.175) { return value = 66.4; }
  else if (analogFC28 >= 2714.985 && analogFC28 < 2719.08) { return value = 66.3; }
  else if (analogFC28 >= 2710.89 && analogFC28 < 2714.985) { return value = 66.2; }
  else if (analogFC28 >= 2706.795 && analogFC28 < 2710.89) { return value = 66.1; }

  // Percentage Range: 65.1-66.0
  if (analogFC28 >= 2702.7 && analogFC28 < 2706.795) { return value = 66.0; } 
  else if (analogFC28 >= 2698.605 && analogFC28 < 2702.7) { return value = 65.9; }
  else if (analogFC28 >= 2694.51 && analogFC28 < 2698.605) { return value = 65.8; }
  else if (analogFC28 >= 2690.415 && analogFC28 < 2694.51) { return value = 65.7; }
  else if (analogFC28 >= 2686.32 && analogFC28 < 2690.415) { return value = 65.6; }
  else if (analogFC28 >= 2682.225 && analogFC28 < 2686.32) { return value = 65.5; }
  else if (analogFC28 >= 2678.13 && analogFC28 < 2682.225) { return value = 65.4; }
  else if (analogFC28 >= 2674.035 && analogFC28 < 2678.13) { return value = 65.3; }
  else if (analogFC28 >= 2669.94 && analogFC28 < 2674.035) { return value = 65.2; }
  else if (analogFC28 >= 2665.845 && analogFC28 < 2669.94) { return value = 65.1; }

