dcmwijaya/ESP_FC28_Library/ESP32_FC28.cpp
  // Percentage Range: 64.1-65.0
  if (analogFC28 >= 2661.75 && analogFC28 < 2665.845) { return value = 65.0; } 
  else if (analogFC28 >= 2657.655 && analogFC28 < 2661.75) { return value = 64.9; }
  else if (analogFC28 >= 2653.56 && analogFC28 < 2657.655) { return value = 64.8; }
  else if (analogFC28 >= 2649.465 && analogFC28 < 2653.56) { return value = 64.7; }
  else if (analogFC28 >= 2645.37 && analogFC28 < 2649.465) { return value = 64.6; }
  else if (analogFC28 >= 2641.275 && analogFC28 < 2645.37) { return value = 64.5; }
  else if (analogFC28 >= 2637.18 && analogFC28 < 2641.275) { return value = 64.4; }
  else if (analogFC28 >= 2633.085 && analogFC28 < 2637.18) { return value = 64.3; }
  else if (analogFC28 >= 2628.99 && analogFC28 < 2633.085) { return value = 64.2; }
  else if (analogFC28 >= 2624.895 && analogFC28 < 2628.99) { return value = 64.1; }

  // Percentage Range: 63.1-64.0
  if (analogFC28 >= 2620.8 && analogFC28 < 2624.895) { return value = 64.0; } 
  else if (analogFC28 >= 2616.705 && analogFC28 < 2620.8) { return value = 63.9; }
  else if (analogFC28 >= 2612.61 && analogFC28 < 2616.705) { return value = 63.8; }
  else if (analogFC28 >= 2608.515 && analogFC28 < 2612.61) { return value = 63.7; }
  else if (analogFC28 >= 2604.42 && analogFC28 < 2608.515) { return value = 63.6; }
  else if (analogFC28 >= 2600.325 && analogFC28 < 2604.42) { return value = 63.5; }
  else if (analogFC28 >= 2596.23 && analogFC28 < 2600.325) { return value = 63.4; }
  else if (analogFC28 >= 2592.135 && analogFC28 < 2596.23) { return value = 63.3; }
  else if (analogFC28 >= 2588.04 && analogFC28 < 2592.135) { return value = 63.2; }
  else if (analogFC28 >= 2583.945 && analogFC28 < 2588.04) { return value = 63.1; }

  // Percentage Range: 62.1-63.0
  if (analogFC28 >= 2579.85 && analogFC28 < 2583.945) { return value = 63.0; } 
  else if (analogFC28 >= 2575.755 && analogFC28 < 2579.85) { return value = 62.9; }
  else if (analogFC28 >= 2571.66 && analogFC28 < 2575.755) { return value = 62.8; }
  else if (analogFC28 >= 2567.565 && analogFC28 < 2571.66) { return value = 62.7; }
  else if (analogFC28 >= 2563.47 && analogFC28 < 2567.565) { return value = 62.6; }
  else if (analogFC28 >= 2559.375 && analogFC28 < 2563.47) { return value = 62.5; }
  else if (analogFC28 >= 2555.28 && analogFC28 < 2559.375) { return value = 62.4; }
  else if (analogFC28 >= 2551.185 && analogFC28 < 2555.28) { return value = 62.3; }
  else if (analogFC28 >= 2547.09 && analogFC28 < 2551.185) { return value = 62.2; }
  else if (analogFC28 >= 2542.995 && analogFC28 < 2547.09) { return value = 62.1; }

  // Percentage Range: 61.1-62.0
  if (analogFC28 >= 2538.9 && analogFC28 < 2542.995) { return value = 62.0; } 
  else if (analogFC28 >= 2534.805 && analogFC28 < 2538.9) { return value = 61.9; }
  else if (analogFC28 >= 2530.71 && analogFC28 < 2534.805) { return value = 61.8; }
  else if (analogFC28 >= 2526.615 && analogFC28 < 2530.71) { return value = 61.7; }
  else if (analogFC28 >= 2522.52 && analogFC28 < 2526.615) { return value = 61.6; }
  else if (analogFC28 >= 2518.425 && analogFC28 < 2522.52) { return value = 61.5; }
  else if (analogFC28 >= 2514.33 && analogFC28 < 2518.425) { return value = 61.4; }
  else if (analogFC28 >= 2510.235 && analogFC28 < 2514.33) { return value = 61.3; }
  else if (analogFC28 >= 2506.14 && analogFC28 < 2510.235) { return value = 61.2; }
  else if (analogFC28 >= 2502.045 && analogFC28 < 2506.14) { return value = 61.1; }

  // Percentage Range: 60.1-61.0
  if (analogFC28 >= 2497.95 && analogFC28 < 2502.045) { return value = 61.0; } 
  else if (analogFC28 >= 2493.855 && analogFC28 < 2497.95) { return value = 60.9; }
  else if (analogFC28 >= 2489.76 && analogFC28 < 2493.855) { return value = 60.8; }
  else if (analogFC28 >= 2485.665 && analogFC28 < 2489.76) { return value = 60.7; }
  else if (analogFC28 >= 2481.57 && analogFC28 < 2485.665) { return value = 60.6; }
  else if (analogFC28 >= 2477.475 && analogFC28 < 2481.57) { return value = 60.5; }
  else if (analogFC28 >= 2473.38 && analogFC28 < 2477.475) { return value = 60.4; }
  else if (analogFC28 >= 2469.285 && analogFC28 < 2473.38) { return value = 60.3; }
  else if (analogFC28 >= 2465.19 && analogFC28 < 2469.285) { return value = 60.2; }
  else if (analogFC28 >= 2461.095 && analogFC28 < 2465.19) { return value = 60.1; }

  // Percentage Range: 59.1-60.0
  if (analogFC28 >= 2457 && analogFC28 < 2461.095) { return value = 60.0; } 
  else if (analogFC28 >= 2452.905 && analogFC28 < 2457) { return value = 59.9; }
  else if (analogFC28 >= 2448.81 && analogFC28 < 2452.905) { return value = 59.8; }
  else if (analogFC28 >= 2444.715 && analogFC28 < 2448.81) { return value = 59.7; }
  else if (analogFC28 >= 2440.62 && analogFC28 < 2444.715) { return value = 59.6; }
  else if (analogFC28 >= 2436.525 && analogFC28 < 2440.62) { return value = 59.5; }
  else if (analogFC28 >= 2432.43 && analogFC28 < 2436.525) { return value = 59.4; }
  else if (analogFC28 >= 2428.335 && analogFC28 < 2432.43) { return value = 59.3; }
  else if (analogFC28 >= 2424.24 && analogFC28 < 2428.335) { return value = 59.2; }
  else if (analogFC28 >= 2420.145 && analogFC28 < 2424.24) { return value = 59.1; }

  // Percentage Range: 58.1-59.0
  if (analogFC28 >= 2416.05 && analogFC28 < 2420.145) { return value = 59.0; } 
  else if (analogFC28 >= 2411.955 && analogFC28 < 2416.05) { return value = 58.9; }
  else if (analogFC28 >= 2407.86 && analogFC28 < 2411.955) { return value = 58.8; }
  else if (analogFC28 >= 2403.765 && analogFC28 < 2407.86) { return value = 58.7; }
  else if (analogFC28 >= 2399.67 && analogFC28 < 2403.765) { return value = 58.6; }
  else if (analogFC28 >= 2395.575 && analogFC28 < 2399.67) { return value = 58.5; }
  else if (analogFC28 >= 2391.48 && analogFC28 < 2395.575) { return value = 58.4; }
  else if (analogFC28 >= 2387.385 && analogFC28 < 2391.48) { return value = 58.3; }
  else if (analogFC28 >= 2383.29 && analogFC28 < 2387.385) { return value = 58.2; }
  else if (analogFC28 >= 2379.195 && analogFC28 < 2383.29) { return value = 58.1; }

  // Percentage Range: 57.1-58.0
  if (analogFC28 >= 2375.1 && analogFC28 < 2379.195) { return value = 58.0; } 
  else if (analogFC28 >= 2371.005 && analogFC28 < 2375.1) { return value = 57.9; }
  else if (analogFC28 >= 2366.91 && analogFC28 < 2371.005) { return value = 57.8; }
  else if (analogFC28 >= 2362.815 && analogFC28 < 2366.91) { return value = 57.7; }
  else if (analogFC28 >= 2358.72 && analogFC28 < 2362.815) { return value = 57.6; }
  else if (analogFC28 >= 2354.625 && analogFC28 < 2358.72) { return value = 57.5; }
  else if (analogFC28 >= 2350.53 && analogFC28 < 2354.625) { return value = 57.4; }
  else if (analogFC28 >= 2346.435 && analogFC28 < 2350.53) { return value = 57.3; }
  else if (analogFC28 >= 2342.34 && analogFC28 < 2346.435) { return value = 57.2; }
  else if (analogFC28 >= 2338.245 && analogFC28 < 2342.34) { return value = 57.1; }

