dcmwijaya/ESP_FC28_Library/ESP32_FC28.cpp
  // Percentage Range: 56.1-57.0
  if (analogFC28 >= 2334.15 && analogFC28 < 2338.245) { return value = 57.0; } 
  else if (analogFC28 >= 2330.055 && analogFC28 < 2334.15) { return value = 56.9; }
  else if (analogFC28 >= 2325.96 && analogFC28 < 2330.055) { return value = 56.8; }
  else if (analogFC28 >= 2321.865 && analogFC28 < 2325.96) { return value = 56.7; }
  else if (analogFC28 >= 2317.77 && analogFC28 < 2321.865) { return value = 56.6; }
  else if (analogFC28 >= 2313.675 && analogFC28 < 2317.77) { return value = 56.5; }
  else if (analogFC28 >= 2309.58 && analogFC28 < 2313.675) { return value = 56.4; }
  else if (analogFC28 >= 2305.485 && analogFC28 < 2309.58) { return value = 56.3; }
  else if (analogFC28 >= 2301.39 && analogFC28 < 2305.485) { return value = 56.2; }
  else if (analogFC28 >= 2297.295 && analogFC28 < 2301.39) { return value = 56.1; }

  // Percentage Range: 55.1-56.0
  if (analogFC28 >= 2293.2 && analogFC28 < 2297.295) { return value = 56.0; } 
  else if (analogFC28 >= 2289.105 && analogFC28 < 2293.2) { return value = 55.9; }
  else if (analogFC28 >= 2285.01 && analogFC28 < 2289.105) { return value = 55.8; }
  else if (analogFC28 >= 2280.915 && analogFC28 < 2285.01) { return value = 55.7; }
  else if (analogFC28 >= 2276.82 && analogFC28 < 2280.915) { return value = 55.6; }
  else if (analogFC28 >= 2272.725 && analogFC28 < 2276.82) { return value = 55.5; }
  else if (analogFC28 >= 2268.63 && analogFC28 < 2272.725) { return value = 55.4; }
  else if (analogFC28 >= 2264.535 && analogFC28 < 2268.63) { return value = 55.3; }
  else if (analogFC28 >= 2260.44 && analogFC28 < 2264.535) { return value = 55.2; }
  else if (analogFC28 >= 2256.345 && analogFC28 < 2260.44) { return value = 55.1; }

  // Percentage Range: 54.1-55.0
  if (analogFC28 >= 2252.25 && analogFC28 < 2256.345) { return value = 55.0; } 
  else if (analogFC28 >= 2248.155 && analogFC28 < 2252.25) { return value = 54.9; }
  else if (analogFC28 >= 2244.06 && analogFC28 < 2248.155) { return value = 54.8; }
  else if (analogFC28 >= 2239.965 && analogFC28 < 2244.06) { return value = 54.7; }
  else if (analogFC28 >= 2235.87 && analogFC28 < 2239.965) { return value = 54.6; }
  else if (analogFC28 >= 2231.775 && analogFC28 < 2235.87) { return value = 54.5; }
  else if (analogFC28 >= 2227.68 && analogFC28 < 2231.775) { return value = 54.4; }
  else if (analogFC28 >= 2223.585 && analogFC28 < 2227.68) { return value = 54.3; }
  else if (analogFC28 >= 2219.49 && analogFC28 < 2223.585) { return value = 54.2; }
  else if (analogFC28 >= 2215.395 && analogFC28 < 2219.49) { return value = 54.1; }
  
  // Percentage Range: 53.1-54.0
  if (analogFC28 >= 2211.3 && analogFC28 < 2215.395) { return value = 54.0; } 
  else if (analogFC28 >= 2207.205 && analogFC28 < 2211.3) { return value = 53.9; }
  else if (analogFC28 >= 2203.11 && analogFC28 < 2207.205) { return value = 53.8; }
  else if (analogFC28 >= 2199.015 && analogFC28 < 2203.11) { return value = 53.7; }
  else if (analogFC28 >= 2194.92 && analogFC28 < 2199.015) { return value = 53.6; }
  else if (analogFC28 >= 2190.825 && analogFC28 < 2194.92) { return value = 53.5; }
  else if (analogFC28 >= 2186.73 && analogFC28 < 2190.825) { return value = 53.4; }
  else if (analogFC28 >= 2182.635 && analogFC28 < 2186.73) { return value = 53.3; }
  else if (analogFC28 >= 2178.54 && analogFC28 < 2182.635) { return value = 53.2; }
  else if (analogFC28 >= 2174.445 && analogFC28 < 2178.54) { return value = 53.1; }

  // Percentage Range: 52.1-53.0
  if (analogFC28 >= 2170.35 && analogFC28 < 2174.445) { return value = 53.0; } 
  else if (analogFC28 >= 2166.255 && analogFC28 < 2170.35) { return value = 52.9; }
  else if (analogFC28 >= 2162.16 && analogFC28 < 2166.255) { return value = 52.8; }
  else if (analogFC28 >= 2158.065 && analogFC28 < 2162.16) { return value = 52.7; }
  else if (analogFC28 >= 2153.97 && analogFC28 < 2158.065) { return value = 52.6; }
  else if (analogFC28 >= 2149.875 && analogFC28 < 2153.97) { return value = 52.5; }
  else if (analogFC28 >= 2145.78 && analogFC28 < 2149.875) { return value = 52.4; }
  else if (analogFC28 >= 2141.685 && analogFC28 < 2145.78) { return value = 52.3; }
  else if (analogFC28 >= 2137.59 && analogFC28 < 2141.685) { return value = 52.2; }
  else if (analogFC28 >= 2133.495 && analogFC28 < 2137.59) { return value = 52.1; }

  // Percentage Range: 51.1-52.0
  if (analogFC28 >= 2129.4 && analogFC28 < 2133.495) { return value = 52.0; } 
  else if (analogFC28 >= 2125.305 && analogFC28 < 2129.4) { return value = 51.9; }
  else if (analogFC28 >= 2121.21 && analogFC28 < 2125.305) { return value = 51.8; }
  else if (analogFC28 >= 2117.115 && analogFC28 < 2121.21) { return value = 51.7; }
  else if (analogFC28 >= 2113.02 && analogFC28 < 2117.115) { return value = 51.6; }
  else if (analogFC28 >= 2108.925 && analogFC28 < 2113.02) { return value = 51.5; }
  else if (analogFC28 >= 2104.83 && analogFC28 < 2108.925) { return value = 51.4; }
  else if (analogFC28 >= 2100.735 && analogFC28 < 2104.83) { return value = 51.3; }
  else if (analogFC28 >= 2096.64 && analogFC28 < 2100.735) { return value = 51.2; }
  else if (analogFC28 >= 2092.545 && analogFC28 < 2096.64) { return value = 51.1; }

  // Percentage Range: 50.1-51.0
  if (analogFC28 >= 2088.45 && analogFC28 < 2092.545) { return value = 51.0; } 
  else if (analogFC28 >= 2084.355 && analogFC28 < 2088.45) { return value = 50.9; }
  else if (analogFC28 >= 2080.26 && analogFC28 < 2084.355) { return value = 50.8; }
  else if (analogFC28 >= 2076.165 && analogFC28 < 2080.26) { return value = 50.7; }
  else if (analogFC28 >= 2072.07 && analogFC28 < 2076.165) { return value = 50.6; }
  else if (analogFC28 >= 2067.975 && analogFC28 < 2072.07) { return value = 50.5; }
  else if (analogFC28 >= 2063.88 && analogFC28 < 2067.975) { return value = 50.4; }
  else if (analogFC28 >= 2059.785 && analogFC28 < 2063.88) { return value = 50.3; }
  else if (analogFC28 >= 2055.69 && analogFC28 < 2059.785) { return value = 50.2; }
  else if (analogFC28 >= 2051.595 && analogFC28 < 2055.69) { return value = 50.1; }

  // Percentage Range: 49.1-50.0
  if (analogFC28 >= 2047.5 && analogFC28 < 2051.595) { return value = 50.0; } 
  else if (analogFC28 >= 2043.405 && analogFC28 < 2047.5) { return value = 49.9; }
  else if (analogFC28 >= 2039.31 && analogFC28 < 2043.405) { return value = 49.8; }
  else if (analogFC28 >= 2035.215 && analogFC28 < 2039.31) { return value = 49.7; }
  else if (analogFC28 >= 2031.12 && analogFC28 < 2035.215) { return value = 49.6; }
  else if (analogFC28 >= 2027.025 && analogFC28 < 2031.12) { return value = 49.5; }
  else if (analogFC28 >= 2022.93 && analogFC28 < 2027.025) { return value = 49.4; }
  else if (analogFC28 >= 2018.835 && analogFC28 < 2022.93) { return value = 49.3; }
  else if (analogFC28 >= 2014.74 && analogFC28 < 2018.835) { return value = 49.2; }
  else if (analogFC28 >= 2010.645 && analogFC28 < 2014.74) { return value = 49.1; }

  // Percentage Range: 48.1-49.0
  if (analogFC28 >= 2006.55 && analogFC28 < 2010.645) { return value = 49.0; } 
  else if (analogFC28 >= 2002.455 && analogFC28 < 2006.55) { return value = 48.9; }
  else if (analogFC28 >= 1998.36 && analogFC28 < 2002.455) { return value = 48.8; }
  else if (analogFC28 >= 1994.265 && analogFC28 < 1998.36) { return value = 48.7; }
  else if (analogFC28 >= 1990.17 && analogFC28 < 1994.265) { return value = 48.6; }
  else if (analogFC28 >= 1986.075 && analogFC28 < 1990.17) { return value = 48.5; }
  else if (analogFC28 >= 1981.98 && analogFC28 < 1986.075) { return value = 48.4; }
  else if (analogFC28 >= 1977.885 && analogFC28 < 1981.98) { return value = 48.3; }
  else if (analogFC28 >= 1973.79 && analogFC28 < 1977.885) { return value = 48.2; }
  else if (analogFC28 >= 1969.695 && analogFC28 < 1973.79) { return value = 48.1; }

  // Percentage Range: 47.1-48.0
  if (analogFC28 >= 1965.6 && analogFC28 < 1969.695) { return value = 48.0; } 
  else if (analogFC28 >= 1961.505 && analogFC28 < 1965.6) { return value = 47.9; }
  else if (analogFC28 >= 1951.41 && analogFC28 < 1961.505) { return value = 47.8; }
  else if (analogFC28 >= 1953.315 && analogFC28 < 1951.41) { return value = 47.7; }
  else if (analogFC28 >= 1949.22 && analogFC28 < 1953.315) { return value = 47.6; }
  else if (analogFC28 >= 1945.125 && analogFC28 < 1949.22) { return value = 47.5; }
  else if (analogFC28 >= 1941.03 && analogFC28 < 1945.125) { return value = 47.4; }
  else if (analogFC28 >= 1936.935 && analogFC28 < 1941.03) { return value = 47.3; }
  else if (analogFC28 >= 1932.84 && analogFC28 < 1936.935) { return value = 47.2; }
  else if (analogFC28 >= 1928.745 && analogFC28 < 1932.84) { return value = 47.1; }

  // Percentage Range: 46.1-47.0
  if (analogFC28 >= 1924.65 && analogFC28 < 1928.745) { return value = 47.0; } 
  else if (analogFC28 >= 1920.555 && analogFC28 < 1924.65) { return value = 46.9; }
  else if (analogFC28 >= 1916.46 && analogFC28 < 1920.555) { return value = 46.8; }
  else if (analogFC28 >= 1912.365 && analogFC28 < 1916.46) { return value = 46.7; }
  else if (analogFC28 >= 1908.27 && analogFC28 < 1912.365) { return value = 46.6; }
  else if (analogFC28 >= 1904.175 && analogFC28 < 1908.27) { return value = 46.5; }
  else if (analogFC28 >= 1900.08 && analogFC28 < 1904.175) { return value = 46.4; }
  else if (analogFC28 >= 1895.985 && analogFC28 < 1900.08) { return value = 46.3; }
  else if (analogFC28 >= 1891.89 && analogFC28 < 1895.985) { return value = 46.2; }
  else if (analogFC28 >= 1887.795 && analogFC28 < 1891.89) { return value = 46.1; }

  // Percentage Range: 45.1-46.0
  if (analogFC28 >= 1883.7 && analogFC28 < 1887.795) { return value = 46.0; } 
  else if (analogFC28 >= 1879.605 && analogFC28 < 1883.7) { return value = 45.9; }
  else if (analogFC28 >= 1875.51 && analogFC28 < 1879.605) { return value = 45.8; }
  else if (analogFC28 >= 1871.415 && analogFC28 < 1875.51) { return value = 45.7; }
  else if (analogFC28 >= 1867.32 && analogFC28 < 1871.415) { return value = 45.6; }
  else if (analogFC28 >= 1863.225 && analogFC28 < 1867.32) { return value = 45.5; }
  else if (analogFC28 >= 1859.13 && analogFC28 < 1863.225) { return value = 45.4; }
  else if (analogFC28 >= 1855.035 && analogFC28 < 1859.13) { return value = 45.3; }
  else if (analogFC28 >= 1850.94 && analogFC28 < 1855.035) { return value = 45.2; }
  else if (analogFC28 >= 1846.845 && analogFC28 < 1850.94) { return value = 45.1; }

  // Percentage Range: 44.1-45.0
  if (analogFC28 >= 1842.75 && analogFC28 < 1846.845) { return value = 45.0; } 
  else if (analogFC28 >= 1838.655 && analogFC28 < 1842.75) { return value = 44.9; }
  else if (analogFC28 >= 1834.56 && analogFC28 < 1838.655) { return value = 44.8; }
  else if (analogFC28 >= 1830.465 && analogFC28 < 1834.56) { return value = 44.7; }
  else if (analogFC28 >= 1826.37 && analogFC28 < 1830.465) { return value = 44.6; }
  else if (analogFC28 >= 1822.275 && analogFC28 < 1826.37) { return value = 44.5; }
  else if (analogFC28 >= 1818.18 && analogFC28 < 1822.275) { return value = 44.4; }
  else if (analogFC28 >= 1814.085 && analogFC28 < 1818.18) { return value = 44.3; }
  else if (analogFC28 >= 1809.99 && analogFC28 < 1814.085) { return value = 44.2; }
  else if (analogFC28 >= 1805.895 && analogFC28 < 1809.99) { return value = 44.1; }

  // Percentage Range: 43.1-44.0
  if (analogFC28 >= 1801.8 && analogFC28 < 1805.895) { return value = 44.0; } 
  else if (analogFC28 >= 1797.705 && analogFC28 < 1801.8) { return value = 43.9; }
  else if (analogFC28 >= 1793.61 && analogFC28 < 1797.705) { return value = 43.8; }
  else if (analogFC28 >= 1789.515 && analogFC28 < 1793.61) { return value = 43.7; }
  else if (analogFC28 >= 1785.42 && analogFC28 < 1789.515) { return value = 43.6; }
  else if (analogFC28 >= 1781.325 && analogFC28 < 1785.42) { return value = 43.5; }
  else if (analogFC28 >= 1777.23 && analogFC28 < 1781.325) { return value = 43.4; }
  else if (analogFC28 >= 1773.135 && analogFC28 < 1777.23) { return value = 43.3; }
  else if (analogFC28 >= 1769.04 && analogFC28 < 1773.135) { return value = 43.2; }
  else if (analogFC28 >= 1764.945 && analogFC28 < 1769.04) { return value = 43.1; }

