dcmwijaya/ESP_FC28_Library/ESP32_FC28.cpp
  // Percentage Range: 42.1-43.0
  if (analogFC28 >= 1760.85 && analogFC28 < 1764.945) { return value = 43.0; } 
  else if (analogFC28 >= 1756.755 && analogFC28 < 1760.85) { return value = 42.9; }
  else if (analogFC28 >= 1752.66 && analogFC28 < 1756.755) { return value = 42.8; }
  else if (analogFC28 >= 1748.565 && analogFC28 < 1752.66) { return value = 42.7; }
  else if (analogFC28 >= 1744.47 && analogFC28 < 1748.565) { return value = 42.6; }
  else if (analogFC28 >= 1740.375 && analogFC28 < 1744.47) { return value = 42.5; }
  else if (analogFC28 >= 1736.28 && analogFC28 < 1740.375) { return value = 42.4; }
  else if (analogFC28 >= 1732.185 && analogFC28 < 1736.28) { return value = 42.3; }
  else if (analogFC28 >= 1728.09 && analogFC28 < 1732.185) { return value = 42.2; }
  else if (analogFC28 >= 1723.995 && analogFC28 < 1728.09) { return value = 42.1; }

  // Percentage Range: 41.1-42.0
  if (analogFC28 >= 1719.9 && analogFC28 < 1723.995) { return value = 42.0; } 
  else if (analogFC28 >= 1715.805 && analogFC28 < 1719.9) { return value = 41.9; }
  else if (analogFC28 >= 1711.71 && analogFC28 < 1715.805) { return value = 41.8; }
  else if (analogFC28 >= 1707.615 && analogFC28 < 1711.71) { return value = 41.7; }
  else if (analogFC28 >= 1703.52 && analogFC28 < 1707.615) { return value = 41.6; }
  else if (analogFC28 >= 1699.425 && analogFC28 < 1703.52) { return value = 41.5; }
  else if (analogFC28 >= 1695.33 && analogFC28 < 1699.425) { return value = 41.4; }
  else if (analogFC28 >= 1691.235 && analogFC28 < 1695.33) { return value = 41.3; }
  else if (analogFC28 >= 1687.14 && analogFC28 < 1691.235) { return value = 41.2; }
  else if (analogFC28 >= 1683.045 && analogFC28 < 1687.14) { return value = 41.1; }

  // Percentage Range: 40.1-41.0
  if (analogFC28 >= 1678.95 && analogFC28 < 1683.045) { return value = 41.0; } 
  else if (analogFC28 >= 1674.855 && analogFC28 < 1678.95) { return value = 40.9; }
  else if (analogFC28 >= 1670.76 && analogFC28 < 1674.855) { return value = 40.8; }
  else if (analogFC28 >= 1666.665 && analogFC28 < 1670.76) { return value = 40.7; }
  else if (analogFC28 >= 1662.57 && analogFC28 < 1666.665) { return value = 40.6; }
  else if (analogFC28 >= 1658.475 && analogFC28 < 1662.57) { return value = 40.5; }
  else if (analogFC28 >= 1654.38 && analogFC28 < 1658.475) { return value = 40.4; }
  else if (analogFC28 >= 1650.285 && analogFC28 < 1654.38) { return value = 40.3; }
  else if (analogFC28 >= 1646.19 && analogFC28 < 1650.285) { return value = 40.2; }
  else if (analogFC28 >= 1642.095 && analogFC28 < 1646.19) { return value = 40.1; }

  // Percentage Range: 39.1-40.0
  if (analogFC28 >= 1638 && analogFC28 < 1642.095) { return value = 40.0; } 
  else if (analogFC28 >= 1633.905 && analogFC28 < 1638) { return value = 39.9; }
  else if (analogFC28 >= 1629.81 && analogFC28 < 1633.905) { return value = 39.8; }
  else if (analogFC28 >= 1625.715 && analogFC28 < 1629.81) { return value = 39.7; }
  else if (analogFC28 >= 1621.62 && analogFC28 < 1625.715) { return value = 39.6; }
  else if (analogFC28 >= 1617.525 && analogFC28 < 1621.62) { return value = 39.5; }
  else if (analogFC28 >= 1613.43 && analogFC28 < 1617.525) { return value = 39.4; }
  else if (analogFC28 >= 1609.335 && analogFC28 < 1613.43) { return value = 39.3; }
  else if (analogFC28 >= 1605.24 && analogFC28 < 1609.335) { return value = 39.2; }
  else if (analogFC28 >= 1601.145 && analogFC28 < 1605.24) { return value = 39.1; }

  // Percentage Range: 38.1-39.0
  if (analogFC28 >= 1597.05 && analogFC28 < 1601.145) { return value = 39.0; } 
  else if (analogFC28 >= 1592.955 && analogFC28 < 1597.05) { return value = 38.9; }
  else if (analogFC28 >= 1588.86 && analogFC28 < 1592.955) { return value = 38.8; }
  else if (analogFC28 >= 1584.765 && analogFC28 < 1588.86) { return value = 38.7; }
  else if (analogFC28 >= 1580.67 && analogFC28 < 1584.765) { return value = 38.6; }
  else if (analogFC28 >= 1576.575 && analogFC28 < 1580.67) { return value = 38.5; }
  else if (analogFC28 >= 1572.48 && analogFC28 < 1576.575) { return value = 38.4; }
  else if (analogFC28 >= 1568.385 && analogFC28 < 1572.48) { return value = 38.3; }
  else if (analogFC28 >= 1564.29 && analogFC28 < 1568.385) { return value = 38.2; }
  else if (analogFC28 >= 1560.195 && analogFC28 < 1564.29) { return value = 38.1; }

  // Percentage Range: 37.1-38.0
  if (analogFC28 >= 1556.1 && analogFC28 < 1560.195) { return value = 38.0; } 
  else if (analogFC28 >= 1552.005 && analogFC28 < 1556.1) { return value = 37.9; }
  else if (analogFC28 >= 1547.91 && analogFC28 < 1552.005) { return value = 37.8; }
  else if (analogFC28 >= 1543.815 && analogFC28 < 1547.91) { return value = 37.7; }
  else if (analogFC28 >= 1539.72 && analogFC28 < 1543.815) { return value = 37.6; }
  else if (analogFC28 >= 1535.625 && analogFC28 < 1539.72) { return value = 37.5; }
  else if (analogFC28 >= 1531.53 && analogFC28 < 1535.625) { return value = 37.4; }
  else if (analogFC28 >= 1527.435 && analogFC28 < 1531.53) { return value = 37.3; }
  else if (analogFC28 >= 1523.34 && analogFC28 < 1527.435) { return value = 37.2; }
  else if (analogFC28 >= 1519.245 && analogFC28 < 1523.34) { return value = 37.1; }

  // Percentage Range: 36.1-37.0
  if (analogFC28 >= 1515.15 && analogFC28 < 1519.245) { return value = 37.0; } 
  else if (analogFC28 >= 1511.055 && analogFC28 < 1515.15) { return value = 36.9; }
  else if (analogFC28 >= 1506.96 && analogFC28 < 1511.055) { return value = 36.8; }
  else if (analogFC28 >= 1502.865 && analogFC28 < 1506.96) { return value = 36.7; }
  else if (analogFC28 >= 1498.77 && analogFC28 < 1502.865) { return value = 36.6; }
  else if (analogFC28 >= 1494.675 && analogFC28 < 1498.77) { return value = 36.5; }
  else if (analogFC28 >= 1490.58 && analogFC28 < 1494.675) { return value = 36.4; }
  else if (analogFC28 >= 1486.485 && analogFC28 < 1490.58) { return value = 36.3; }
  else if (analogFC28 >= 1482.39 && analogFC28 < 1486.485) { return value = 36.2; }
  else if (analogFC28 >= 1478.295 && analogFC28 < 1482.39) { return value = 36.1; }

  // Percentage Range: 35.1-36.0
  if (analogFC28 >= 1474.2 && analogFC28 < 1478.295) { return value = 36.0; } 
  else if (analogFC28 >= 1470.105 && analogFC28 < 1474.2) { return value = 35.9; }
  else if (analogFC28 >= 1466.01 && analogFC28 < 1470.105) { return value = 35.8; }
  else if (analogFC28 >= 1461.915 && analogFC28 < 1466.01) { return value = 35.7; }
  else if (analogFC28 >= 1457.82 && analogFC28 < 1461.915) { return value = 35.6; }
  else if (analogFC28 >= 1453.725 && analogFC28 < 1457.82) { return value = 35.5; }
  else if (analogFC28 >= 1449.63 && analogFC28 < 1453.725) { return value = 35.4; }
  else if (analogFC28 >= 1445.535 && analogFC28 < 1449.63) { return value = 35.3; }
  else if (analogFC28 >= 1441.44 && analogFC28 < 1445.535) { return value = 35.2; }
  else if (analogFC28 >= 1437.345 && analogFC28 < 1441.44) { return value = 35.1; }

  // Percentage Range: 34.1-35.0
  if (analogFC28 >= 1433.25 && analogFC28 < 1437.345) { return value = 35.0; } 
  else if (analogFC28 >= 1429.155 && analogFC28 < 1433.25) { return value = 34.9; }
  else if (analogFC28 >= 1425.06 && analogFC28 < 1429.155) { return value = 34.8; }
  else if (analogFC28 >= 1420.965 && analogFC28 < 1425.06) { return value = 34.7; }
  else if (analogFC28 >= 1416.87 && analogFC28 < 1420.965) { return value = 34.6; }
  else if (analogFC28 >= 1412.775 && analogFC28 < 1416.87) { return value = 34.5; }
  else if (analogFC28 >= 1408.68 && analogFC28 < 1412.775) { return value = 34.4; }
  else if (analogFC28 >= 1404.585 && analogFC28 < 1408.68) { return value = 34.3; }
  else if (analogFC28 >= 1400.49 && analogFC28 < 1404.585) { return value = 34.2; }
  else if (analogFC28 >= 1396.395 && analogFC28 < 1400.49) { return value = 34.1; }

  // Percentage Range: 33.1-34.0
  if (analogFC28 >= 1392.3 && analogFC28 < 1396.395) { return value = 34.0; } 
  else if (analogFC28 >= 1388.205 && analogFC28 < 1392.3) { return value = 33.9; }
  else if (analogFC28 >= 1384.11 && analogFC28 < 1388.205) { return value = 33.8; }
  else if (analogFC28 >= 1380.015 && analogFC28 < 1384.11) { return value = 33.7; }
  else if (analogFC28 >= 1375.92 && analogFC28 < 1380.015) { return value = 33.6; }
  else if (analogFC28 >= 1371.825 && analogFC28 < 1375.92) { return value = 33.5; }
  else if (analogFC28 >= 1367.73 && analogFC28 < 1371.825) { return value = 33.4; }
  else if (analogFC28 >= 1363.635 && analogFC28 < 1367.73) { return value = 33.3; }
  else if (analogFC28 >= 1359.54 && analogFC28 < 1363.635) { return value = 33.2; }
  else if (analogFC28 >= 1355.445 && analogFC28 < 1359.54) { return value = 33.1; }

