dcmwijaya/ESP_FC28_Library/ESP32_FC28.cpp
  // Percentage Range: 32.1-33.0
  if (analogFC28 >= 1351.35 && analogFC28 < 1355.445) { return value = 33.0; } 
  else if (analogFC28 >= 1347.255 && analogFC28 < 1351.35) { return value = 32.9; }
  else if (analogFC28 >= 1343.16 && analogFC28 < 1347.255) { return value = 32.8; }
  else if (analogFC28 >= 1339.065 && analogFC28 < 1343.16) { return value = 32.7; }
  else if (analogFC28 >= 1334.97 && analogFC28 < 1339.065) { return value = 32.6; }
  else if (analogFC28 >= 1330.875 && analogFC28 < 1334.97) { return value = 32.5; }
  else if (analogFC28 >= 1326.78 && analogFC28 < 1330.875) { return value = 32.4; }
  else if (analogFC28 >= 1322.685 && analogFC28 < 1326.78) { return value = 32.3; }
  else if (analogFC28 >= 1318.59 && analogFC28 < 1322.685) { return value = 32.2; }
  else if (analogFC28 >= 1314.495 && analogFC28 < 1318.59) { return value = 32.1; }

  // Percentage Range: 31.1-32.0
  if (analogFC28 >= 1304.4 && analogFC28 < 1314.495) { return value = 32.0; } 
  else if (analogFC28 >= 1306.305 && analogFC28 < 1304.4) { return value = 31.9; }
  else if (analogFC28 >= 1302.21 && analogFC28 < 1306.305) { return value = 31.8; }
  else if (analogFC28 >= 1298.115 && analogFC28 < 1302.21) { return value = 31.7; }
  else if (analogFC28 >= 1294.02 && analogFC28 < 1298.115) { return value = 31.6; }
  else if (analogFC28 >= 1289.925 && analogFC28 < 1294.02) { return value = 31.5; }
  else if (analogFC28 >= 1285.83 && analogFC28 < 1289.925) { return value = 31.4; }
  else if (analogFC28 >= 1281.735 && analogFC28 < 1285.83) { return value = 31.3; }
  else if (analogFC28 >= 1277.64 && analogFC28 < 1281.735) { return value = 31.2; }
  else if (analogFC28 >= 1273.545 && analogFC28 < 1277.64) { return value = 31.1; }
  
  // Percentage Range: 30.1-31.0
  if (analogFC28 >= 1269.45 && analogFC28 < 1273.545) { return value = 31.0; } 
  else if (analogFC28 >= 1265.355 && analogFC28 < 1269.45) { return value = 30.9; }
  else if (analogFC28 >= 1261.26 && analogFC28 < 1265.355) { return value = 30.8; }
  else if (analogFC28 >= 1257.165 && analogFC28 < 1261.26) { return value = 30.7; }
  else if (analogFC28 >= 1253.07 && analogFC28 < 1257.165) { return value = 30.6; }
  else if (analogFC28 >= 1248.975 && analogFC28 < 1253.07) { return value = 30.5; }
  else if (analogFC28 >= 1244.88 && analogFC28 < 1248.975) { return value = 30.4; }
  else if (analogFC28 >= 1240.785 && analogFC28 < 1244.88) { return value = 30.3; }
  else if (analogFC28 >= 1236.69 && analogFC28 < 1240.785) { return value = 30.2; }
  else if (analogFC28 >= 1232.595 && analogFC28 < 1236.69) { return value = 30.1; }

  // Percentage Range: 29.1-30.0
  if (analogFC28 >= 1228.5 && analogFC28 < 1232.595) { return value = 30.0; } 
  else if (analogFC28 >= 1224.405 && analogFC28 < 1228.5) { return value = 29.9; }
  else if (analogFC28 >= 1220.31 && analogFC28 < 1224.405) { return value = 29.8; }
  else if (analogFC28 >= 1216.215 && analogFC28 < 1220.31) { return value = 29.7; }
  else if (analogFC28 >= 1212.12 && analogFC28 < 1216.215) { return value = 29.6; }
  else if (analogFC28 >= 1208.025 && analogFC28 < 1212.12) { return value = 29.5; }
  else if (analogFC28 >= 1203.93 && analogFC28 < 1208.025) { return value = 29.4; }
  else if (analogFC28 >= 1199.835 && analogFC28 < 1203.93) { return value = 29.3; }
  else if (analogFC28 >= 1195.74 && analogFC28 < 1199.835) { return value = 29.2; }
  else if (analogFC28 >= 1191.645 && analogFC28 < 1195.74) { return value = 29.1; }
  
  // Percentage Range: 28.1-29.0
  if (analogFC28 >= 1187.55 && analogFC28 < 1191.645) { return value = 29.0; }
  else if (analogFC28 >= 1183.455 && analogFC28 < 1187.55) { return value = 28.9; }
  else if (analogFC28 >= 1179.36 && analogFC28 < 1183.455) { return value = 28.8; }
  else if (analogFC28 >= 1175.265 && analogFC28 < 1179.36) { return value = 28.7; }
  else if (analogFC28 >= 1171.17 && analogFC28 < 1175.265) { return value = 28.6; }
  else if (analogFC28 >= 1167.075 && analogFC28 < 1171.17) { return value = 28.5; }
  else if (analogFC28 >= 1162.98 && analogFC28 < 1167.075) { return value = 28.4; }
  else if (analogFC28 >= 1158.885 && analogFC28 < 1162.98) { return value = 28.3; }
  else if (analogFC28 >= 1154.79 && analogFC28 < 1158.885) { return value = 28.2; }
  else if (analogFC28 >= 1150.695 && analogFC28 < 1154.79) { return value = 28.1; }

  // Percentage Range: 27.1-28.0
  if (analogFC28 >= 1146.6 && analogFC28 < 1150.695) { return value = 28.0; }
  else if (analogFC28 >= 1142.505 && analogFC28 < 1146.6) { return value = 27.9; }
  else if (analogFC28 >= 1138.41 && analogFC28 < 1142.505) { return value = 27.8; }
  else if (analogFC28 >= 1134.315 && analogFC28 < 1138.41) { return value = 27.7; }
  else if (analogFC28 >= 1130.22 && analogFC28 < 1134.315) { return value = 27.6; }
  else if (analogFC28 >= 1126.125 && analogFC28 < 1130.22) { return value = 27.5; }
  else if (analogFC28 >= 1122.03 && analogFC28 < 1126.125) { return value = 27.4; }
  else if (analogFC28 >= 1117.935 && analogFC28 < 1122.03) { return value = 27.3; }
  else if (analogFC28 >= 1113.84 && analogFC28 < 1117.935) { return value = 27.2; }
  else if (analogFC28 >= 1109.745 && analogFC28 < 1113.84) { return value = 27.1; }

  // Percentage Range: 26.1-27.0
  if (analogFC28 >= 1105.65 && analogFC28 < 1109.745) { return value = 27.0; }
  else if (analogFC28 >= 1101.555 && analogFC28 < 1105.65) { return value = 26.9; }
  else if (analogFC28 >= 1097.46 && analogFC28 < 1101.555) { return value = 26.8; }
  else if (analogFC28 >= 1093.365 && analogFC28 < 1097.46) { return value = 26.7; }
  else if (analogFC28 >= 1089.27 && analogFC28 < 1093.365) { return value = 26.6; }
  else if (analogFC28 >= 1085.175 && analogFC28 < 1089.27) { return value = 26.5; }
  else if (analogFC28 >= 1081.08 && analogFC28 < 1085.175) { return value = 26.4; }
  else if (analogFC28 >= 1076.985 && analogFC28 < 1081.08) { return value = 26.3; }
  else if (analogFC28 >= 1072.89 && analogFC28 < 1076.985) { return value = 26.2; }
  else if (analogFC28 >= 1068.795 && analogFC28 < 1072.89) { return value = 26.1; }

