dcmwijaya/ESP_FC28_Library/ESP32_FC28.cpp
  // Percentage Range: 25.1-26.0
  if (analogFC28 >= 1064.7 && analogFC28 < 1068.795) { return value = 26.0; }
  else if (analogFC28 >= 1060.605 && analogFC28 < 1064.7) { return value = 25.9; }
  else if (analogFC28 >= 1056.51 && analogFC28 < 1060.605) { return value = 25.8; }
  else if (analogFC28 >= 1052.415 && analogFC28 < 1056.51) { return value = 25.7; }
  else if (analogFC28 >= 1048.32 && analogFC28 < 1052.415) { return value = 25.6; }
  else if (analogFC28 >= 1044.225 && analogFC28 < 1048.32) { return value = 25.5; }
  else if (analogFC28 >= 1040.13 && analogFC28 < 1044.225) { return value = 25.4; }
  else if (analogFC28 >= 1036.035 && analogFC28 < 1040.13) { return value = 25.3; }
  else if (analogFC28 >= 1031.94 && analogFC28 < 1036.035) { return value = 25.2; }
  else if (analogFC28 >= 1027.845 && analogFC28 < 1031.94) { return value = 25.1; }

  // Percentage Range: 24.1-25.0
  if (analogFC28 >= 1023.75 && analogFC28 < 1027.845) { return value = 25.0; }
  else if (analogFC28 >= 1019.655 && analogFC28 < 1023.75) { return value = 24.9; }
  else if (analogFC28 >= 1015.56 && analogFC28 < 1019.655) { return value = 24.8; }
  else if (analogFC28 >= 1011.465 && analogFC28 < 1015.56) { return value = 24.7; }
  else if (analogFC28 >= 1007.37 && analogFC28 < 1011.465) { return value = 24.6; }
  else if (analogFC28 >= 1003.275 && analogFC28 < 1007.37) { return value = 24.5; }
  else if (analogFC28 >= 999.18 && analogFC28 < 1003.275) { return value = 24.4; }
  else if (analogFC28 >= 995.085 && analogFC28 < 999.18) { return value = 24.3; }
  else if (analogFC28 >= 990.99 && analogFC28 < 995.085) { return value = 24.2; }
  else if (analogFC28 >= 986.895 && analogFC28 < 990.99) { return value = 24.1; }

  // Percentage Range: 23.1-24.0
  if (analogFC28 >= 982.8 && analogFC28 < 986.895) { return value = 24.0; }
  else if (analogFC28 >= 978.705 && analogFC28 < 982.8) { return value = 23.9; }
  else if (analogFC28 >= 974.61 && analogFC28 < 978.705) { return value = 23.8; }
  else if (analogFC28 >= 970.515 && analogFC28 < 974.61) { return value = 23.7; }
  else if (analogFC28 >= 966.42 && analogFC28 < 970.515) { return value = 23.6; }
  else if (analogFC28 >= 962.325 && analogFC28 < 966.42) { return value = 23.5; }
  else if (analogFC28 >= 958.23 && analogFC28 < 962.325) { return value = 23.4; }
  else if (analogFC28 >= 954.135 && analogFC28 < 958.23) { return value = 23.3; }
  else if (analogFC28 >= 950.04 && analogFC28 < 954.135) { return value = 23.2; }
  else if (analogFC28 >= 945.945 && analogFC28 < 950.04) { return value = 23.1; }

  // Percentage Range: 22.1-23.0
  if (analogFC28 >= 941.85 && analogFC28 < 945.945) { return value = 23.0; }
  else if (analogFC28 >= 937.755 && analogFC28 < 941.85) { return value = 22.9; }
  else if (analogFC28 >= 933.66 && analogFC28 < 937.755) { return value = 22.8; }
  else if (analogFC28 >= 929.565 && analogFC28 < 933.66) { return value = 22.7; }
  else if (analogFC28 >= 925.47 && analogFC28 < 929.565) { return value = 22.6; }
  else if (analogFC28 >= 921.375 && analogFC28 < 925.47) { return value = 22.5; }
  else if (analogFC28 >= 917.28 && analogFC28 < 921.375) { return value = 22.4; }
  else if (analogFC28 >= 913.185 && analogFC28 < 917.28) { return value = 22.3; }
  else if (analogFC28 >= 909.09 && analogFC28 < 913.185) { return value = 22.2; }
  else if (analogFC28 >= 904.995 && analogFC28 < 909.09) { return value = 22.1; }

  // Percentage Range: 21.1-22.0
  if (analogFC28 >= 900.9 && analogFC28 < 904.995) { return value = 22.0; }
  else if (analogFC28 >= 896.805 && analogFC28 < 900.9) { return value = 21.9; }
  else if (analogFC28 >= 892.71 && analogFC28 < 896.805) { return value = 21.8; }
  else if (analogFC28 >= 888.615 && analogFC28 < 892.71) { return value = 21.7; }
  else if (analogFC28 >= 884.52 && analogFC28 < 888.615) { return value = 21.6; }
  else if (analogFC28 >= 880.425 && analogFC28 < 884.52) { return value = 21.5; }
  else if (analogFC28 >= 876.33 && analogFC28 < 880.425) { return value = 21.4; }
  else if (analogFC28 >= 872.235 && analogFC28 < 876.33) { return value = 21.3; }
  else if (analogFC28 >= 868.14 && analogFC28 < 872.235) { return value = 21.2; }
  else if (analogFC28 >= 864.045 && analogFC28 < 868.14) { return value = 21.1; }

  // Percentage Range: 20.1-21.0
  if (analogFC28 >= 859.95 && analogFC28 < 864.045) { return value = 21.0; }
  else if (analogFC28 >= 855.855 && analogFC28 < 859.95) { return value = 20.9; }
  else if (analogFC28 >= 851.76 && analogFC28 < 855.855) { return value = 20.8; }
  else if (analogFC28 >= 847.665 && analogFC28 < 851.76) { return value = 20.7; }
  else if (analogFC28 >= 843.57 && analogFC28 < 847.665) { return value = 20.6; }
  else if (analogFC28 >= 839.475 && analogFC28 < 843.57) { return value = 20.5; }
  else if (analogFC28 >= 835.38 && analogFC28 < 839.475) { return value = 20.4; }
  else if (analogFC28 >= 831.285 && analogFC28 < 835.38) { return value = 20.3; }
  else if (analogFC28 >= 827.19 && analogFC28 < 831.285) { return value = 20.2; }
  else if (analogFC28 >= 823.095 && analogFC28 < 827.19) { return value = 20.1; }

  // Percentage Range: 19.1-20.0
  if (analogFC28 >= 819 && analogFC28 < 823.095) { return value = 20.0; }  
  else if (analogFC28 >= 814.905 && analogFC28 < 819) { return value = 19.9; }
  else if (analogFC28 >= 810.81 && analogFC28 < 814.905) { return value = 19.8; }
  else if (analogFC28 >= 806.715 && analogFC28 < 810.81) { return value = 19.7; }
  else if (analogFC28 >= 802.62 && analogFC28 < 806.715) { return value = 19.6; }
  else if (analogFC28 >= 798.525 && analogFC28 < 802.62) { return value = 19.5; }
  else if (analogFC28 >= 794.43 && analogFC28 < 798.525) { return value = 19.4; }
  else if (analogFC28 >= 790.335 && analogFC28 < 794.43) { return value = 19.3; }
  else if (analogFC28 >= 786.24 && analogFC28 < 790.335) { return value = 19.2; }
  else if (analogFC28 >= 782.145 && analogFC28 < 786.24) { return value = 19.1; }
  
  // Percentage Range: 18.1-19.0
  if (analogFC28 >= 778.05 && analogFC28 < 782.145) { return value = 19.0; }
  else if (analogFC28 >= 773.955 && analogFC28 < 778.05) { return value = 18.9; }
  else if (analogFC28 >= 769.86 && analogFC28 < 773.955) { return value = 18.8; }
  else if (analogFC28 >= 765.765 && analogFC28 < 769.86) { return value = 18.7; }
  else if (analogFC28 >= 761.67 && analogFC28 < 765.765) { return value = 18.6; }
  else if (analogFC28 >= 757.575 && analogFC28 < 761.67) { return value = 18.5; }
  else if (analogFC28 >= 753.48 && analogFC28 < 757.575) { return value = 18.4; }
  else if (analogFC28 >= 749.385 && analogFC28 < 753.48) { return value = 18.3; }
  else if (analogFC28 >= 745.29 && analogFC28 < 749.385) { return value = 18.2; }
  else if (analogFC28 >= 741.195 && analogFC28 < 745.29) { return value = 18.1; }

