dcmwijaya/ESP_FC28_Library/ESP32_FC28.cpp
  // Percentage Range: 17.1-18.0
  if (analogFC28 >= 737.1 && analogFC28 < 741.195) { return value = 18.0; }
  else if (analogFC28 >= 733.005 && analogFC28 < 737.1) { return value = 17.9; }
  else if (analogFC28 >= 728.91 && analogFC28 < 733.005) { return value = 17.8; }
  else if (analogFC28 >= 724.815 && analogFC28 < 728.91) { return value = 17.7; }
  else if (analogFC28 >= 720.72 && analogFC28 < 724.815) { return value = 17.6; }
  else if (analogFC28 >= 716.625 && analogFC28 < 720.72) { return value = 17.5; }
  else if (analogFC28 >= 712.53 && analogFC28 < 716.625) { return value = 17.4; }
  else if (analogFC28 >= 708.435 && analogFC28 < 712.53) { return value = 17.3; }
  else if (analogFC28 >= 704.34 && analogFC28 < 708.435) { return value = 17.2; }
  else if (analogFC28 >= 700.245 && analogFC28 < 704.34) { return value = 17.1; }

  // Percentage Range: 16.1-17.0
  if (analogFC28 >= 696.15 && analogFC28 < 700.245) { return value = 17.0; }
  else if (analogFC28 >= 692.055 && analogFC28 < 696.15) { return value = 16.9; }
  else if (analogFC28 >= 687.96 && analogFC28 < 692.055) { return value = 16.8; }
  else if (analogFC28 >= 683.865 && analogFC28 < 687.96) { return value = 16.7; }
  else if (analogFC28 >= 679.77 && analogFC28 < 683.865) { return value = 16.6; }
  else if (analogFC28 >= 675.675 && analogFC28 < 679.77) { return value = 16.5; }
  else if (analogFC28 >= 671.58 && analogFC28 < 675.675) { return value = 16.4; }
  else if (analogFC28 >= 667.485 && analogFC28 < 671.58) { return value = 16.3; }
  else if (analogFC28 >= 663.39 && analogFC28 < 667.485) { return value = 16.2; }
  else if (analogFC28 >= 659.295 && analogFC28 < 663.39) { return value = 16.1; }

  // Percentage Range: 15.1-16.0
  if (analogFC28 >= 655.2 && analogFC28 < 659.295) { return value = 16.0; }
  else if (analogFC28 >= 651.105 && analogFC28 < 655.2) { return value = 15.9; }
  else if (analogFC28 >= 647.01 && analogFC28 < 651.105) { return value = 15.8; }
  else if (analogFC28 >= 642.915 && analogFC28 < 647.01) { return value = 15.7; }
  else if (analogFC28 >= 638.82 && analogFC28 < 642.915) { return value = 15.6; }
  else if (analogFC28 >= 634.725 && analogFC28 < 638.82) { return value = 15.5; }
  else if (analogFC28 >= 630.63 && analogFC28 < 634.725) { return value = 15.4; }
  else if (analogFC28 >= 626.535 && analogFC28 < 630.63) { return value = 15.3; }
  else if (analogFC28 >= 622.44 && analogFC28 < 626.535) { return value = 15.2; }
  else if (analogFC28 >= 618.345 && analogFC28 < 622.44) { return value = 15.1; }

  // Percentage Range: 14.1-15.0
  if (analogFC28 >= 614.25 && analogFC28 < 618.345) { return value = 15.0; }
  else if (analogFC28 >= 610.155 && analogFC28 < 614.25) { return value = 14.9; }
  else if (analogFC28 >= 606.06 && analogFC28 < 610.155) { return value = 14.8; }
  else if (analogFC28 >= 601.965 && analogFC28 < 606.06) { return value = 14.7; }
  else if (analogFC28 >= 597.87 && analogFC28 < 601.965) { return value = 14.6; }
  else if (analogFC28 >= 593.775 && analogFC28 < 597.87) { return value = 14.5; }
  else if (analogFC28 >= 589.68 && analogFC28 < 593.775) { return value = 14.4; }
  else if (analogFC28 >= 585.585 && analogFC28 < 589.68) { return value = 14.3; }
  else if (analogFC28 >= 581.49 && analogFC28 < 585.585) { return value = 14.2; }
  else if (analogFC28 >= 577.395 && analogFC28 < 581.49) { return value = 14.1; }

  // Percentage Range: 13.1-14.0
  if (analogFC28 >= 573.3 && analogFC28 < 577.395) { return value = 14.0; }
  else if (analogFC28 >= 569.205 && analogFC28 < 573.3) { return value = 13.9; }
  else if (analogFC28 >= 565.11 && analogFC28 < 569.205) { return value = 13.8; }
  else if (analogFC28 >= 561.015 && analogFC28 < 565.11) { return value = 13.7; }
  else if (analogFC28 >= 556.92 && analogFC28 < 561.015) { return value = 13.6; }
  else if (analogFC28 >= 552.825 && analogFC28 < 556.92) { return value = 13.5; }
  else if (analogFC28 >= 548.73 && analogFC28 < 552.825) { return value = 13.4; }
  else if (analogFC28 >= 544.635 && analogFC28 < 548.73) { return value = 13.3; }
  else if (analogFC28 >= 540.54 && analogFC28 < 544.635) { return value = 13.2; }
  else if (analogFC28 >= 536.445 && analogFC28 < 540.54) { return value = 13.1; }

  // Percentage Range: 12.1-13.0
  if (analogFC28 >= 532.35 && analogFC28 < 536.445) { return value = 13.0; }
  else if (analogFC28 >= 528.255 && analogFC28 < 532.35) { return value = 12.9; }
  else if (analogFC28 >= 524.16 && analogFC28 < 528.255) { return value = 12.8; }
  else if (analogFC28 >= 520.065 && analogFC28 < 524.16) { return value = 12.7; }
  else if (analogFC28 >= 515.97 && analogFC28 < 520.065) { return value = 12.6; }
  else if (analogFC28 >= 511.875 && analogFC28 < 515.97) { return value = 12.5; }
  else if (analogFC28 >= 507.78 && analogFC28 < 511.875) { return value = 12.4; }
  else if (analogFC28 >= 503.685 && analogFC28 < 507.78) { return value = 12.3; }
  else if (analogFC28 >= 499.59 && analogFC28 < 503.685) { return value = 12.2; }
  else if (analogFC28 >= 495.495 && analogFC28 < 499.59) { return value = 12.1; }

  // Percentage Range: 11.1-12.0
  if (analogFC28 >= 491.4 && analogFC28 < 495.495) { return value = 12.0; }
  else if (analogFC28 >= 487.305 && analogFC28 < 491.4) { return value = 11.9; }
  else if (analogFC28 >= 483.21 && analogFC28 < 487.305) { return value = 11.8; }
  else if (analogFC28 >= 479.115 && analogFC28 < 483.21) { return value = 11.7; }
  else if (analogFC28 >= 475.02 && analogFC28 < 479.115) { return value = 11.6; }
  else if (analogFC28 >= 470.925 && analogFC28 < 475.02) { return value = 11.5; }
  else if (analogFC28 >= 466.83 && analogFC28 < 470.925) { return value = 11.4; }
  else if (analogFC28 >= 462.735 && analogFC28 < 466.83) { return value = 11.3; }
  else if (analogFC28 >= 458.64 && analogFC28 < 462.735) { return value = 11.2; }
  else if (analogFC28 >= 454.545 && analogFC28 < 458.64) { return value = 11.1; }

  // Percentage Range: 10.1-11.0
  if (analogFC28 >= 450.45 && analogFC28 < 454.545) { return value = 11.0; }
  else if (analogFC28 >= 446.355 && analogFC28 < 450.45) { return value = 10.9; }
  else if (analogFC28 >= 442.26 && analogFC28 < 446.355) { return value = 10.8; }
  else if (analogFC28 >= 438.165 && analogFC28 < 442.26) { return value = 10.7; }
  else if (analogFC28 >= 434.07 && analogFC28 < 438.165) { return value = 10.6; }
  else if (analogFC28 >= 429.975 && analogFC28 < 434.07) { return value = 10.5; }
  else if (analogFC28 >= 425.88 && analogFC28 < 429.975) { return value = 10.4; }
  else if (analogFC28 >= 421.785 && analogFC28 < 425.88) { return value = 10.3; }
  else if (analogFC28 >= 417.69 && analogFC28 < 421.785) { return value = 10.2; }
  else if (analogFC28 >= 413.595 && analogFC28 < 417.69) { return value = 10.1; }

