dcmwijaya/ESP_FC28_Library/ESP32_FC28.cpp
  // Percentage Range: 9.1-10.0
  if (analogFC28 >= 409.5 && analogFC28 < 413.595) { return value = 10.0; } 
  else if (analogFC28 >= 405.405 && analogFC28 < 409.5) { return value = 9.9; }
  else if (analogFC28 >= 401.31 && analogFC28 < 405.405) { return value = 9.8; }
  else if (analogFC28 >= 397.215 && analogFC28 < 401.31) { return value = 9.7; }
  else if (analogFC28 >= 393.12 && analogFC28 < 397.215) { return value = 9.6; }
  else if (analogFC28 >= 389.025 && analogFC28 < 393.12) { return value = 9.5; }
  else if (analogFC28 >= 384.93 && analogFC28 < 389.025) { return value = 9.4; }
  else if (analogFC28 >= 380.835 && analogFC28 < 384.93) { return value = 9.3; }
  else if (analogFC28 >= 376.74 && analogFC28 < 380.835) { return value = 9.2; }
  else if (analogFC28 >= 372.645 && analogFC28 < 376.74) { return value = 9.1; }

  // Percentage Range: 8.1-9.0
  if (analogFC28 >= 368.55 && analogFC28 < 372.645) { return value = 9.0; }
  else if (analogFC28 >= 364.455 && analogFC28 < 368.55) { return value = 8.9; }
  else if (analogFC28 >= 360.36 && analogFC28 < 364.455) { return value = 8.8; }
  else if (analogFC28 >= 356.265 && analogFC28 < 360.36) { return value = 8.7; }
  else if (analogFC28 >= 352.17 && analogFC28 < 356.265) { return value = 8.6; }
  else if (analogFC28 >= 348.075 && analogFC28 < 352.17) { return value = 8.5; }
  else if (analogFC28 >= 343.98 && analogFC28 < 348.075) { return value = 8.4; }
  else if (analogFC28 >= 339.885 && analogFC28 < 343.98) { return value = 8.3; }
  else if (analogFC28 >= 335.79 && analogFC28 < 339.885) { return value = 8.2; }
  else if (analogFC28 >= 331.695 && analogFC28 < 335.79) { return value = 8.1; }

  // Percentage Range: 7.1-8.0
  if (analogFC28 >= 327.6 && analogFC28 < 331.695) { return value = 8.0; }
  else if (analogFC28 >= 323.505 && analogFC28 < 327.6) { return value = 7.9; }
  else if (analogFC28 >= 319.41 && analogFC28 < 323.505) { return value = 7.8; }
  else if (analogFC28 >= 315.315 && analogFC28 < 319.41) { return value = 7.7; }
  else if (analogFC28 >= 311.22 && analogFC28 < 315.315) { return value = 7.6; }
  else if (analogFC28 >= 307.125 && analogFC28 < 311.22) { return value = 7.5; }
  else if (analogFC28 >= 303.03 && analogFC28 < 307.125) { return value = 7.4; }
  else if (analogFC28 >= 298.935 && analogFC28 < 303.03) { return value = 7.3; }
  else if (analogFC28 >= 294.84 && analogFC28 < 298.935) { return value = 7.2; }
  else if (analogFC28 >= 290.745 && analogFC28 < 294.84) { return value = 7.1; }

  // Percentage Range: 6.1-7.0
  if (analogFC28 >= 286.65 && analogFC28 < 290.745) { return value = 7.0; }
  else if (analogFC28 >= 282.555 && analogFC28 < 286.65) { return value = 6.9; }
  else if (analogFC28 >= 278.46 && analogFC28 < 282.555) { return value = 6.8; }
  else if (analogFC28 >= 274.365 && analogFC28 < 278.46) { return value = 6.7; }
  else if (analogFC28 >= 270.27 && analogFC28 < 274.365) { return value = 6.6; }
  else if (analogFC28 >= 266.175 && analogFC28 < 270.27) { return value = 6.5; }
  else if (analogFC28 >= 262.08 && analogFC28 < 266.175) { return value = 6.4; }
  else if (analogFC28 >= 257.985 && analogFC28 < 262.08) { return value = 6.3; }
  else if (analogFC28 >= 253.89 && analogFC28 < 257.985) { return value = 6.2; }
  else if (analogFC28 >= 249.795 && analogFC28 < 253.89) { return value = 6.1; }

  // Percentage Range: 5.1-6.0
  if (analogFC28 >= 245.7 && analogFC28 < 249.795) { return value = 6.0; } 
  else if (analogFC28 >= 241.605 && analogFC28 < 245.7) { return value = 5.9; }
  else if (analogFC28 >= 237.51 && analogFC28 < 241.605) { return value = 5.8; }
  else if (analogFC28 >= 233.415 && analogFC28 < 237.51) { return value = 5.7; }
  else if (analogFC28 >= 229.32 && analogFC28 < 233.415) { return value = 5.6; }
  else if (analogFC28 >= 225.225 && analogFC28 < 229.32) { return value = 5.5; }
  else if (analogFC28 >= 221.13 && analogFC28 < 225.225) { return value = 5.4; }
  else if (analogFC28 >= 217.035 && analogFC28 < 221.13) { return value = 5.3; }
  else if (analogFC28 >= 212.94 && analogFC28 < 217.035) { return value = 5.2; }
  else if (analogFC28 >= 208.845 && analogFC28 < 212.94) { return value = 5.1; }

  // Percentage Range: 4.1-5.0
  if (analogFC28 >= 204.75 && analogFC28 < 208.845) { return value = 5.0; } 
  else if (analogFC28 >= 200.655 && analogFC28 < 204.75) { return value = 4.9; }
  else if (analogFC28 >= 196.56 && analogFC28 < 200.655) { return value = 4.8; }
  else if (analogFC28 >= 192.465 && analogFC28 < 196.56) { return value = 4.7; }
  else if (analogFC28 >= 188.37 && analogFC28 < 192.465) { return value = 4.6; }
  else if (analogFC28 >= 184.275 && analogFC28 < 188.37) { return value = 4.5; }
  else if (analogFC28 >= 180.18 && analogFC28 < 184.275) { return value = 4.4; }
  else if (analogFC28 >= 176.085 && analogFC28 < 180.18) { return value = 4.3; }
  else if (analogFC28 >= 171.99 && analogFC28 < 176.085) { return value = 4.2; }
  else if (analogFC28 >= 167.895 && analogFC28 < 171.99) { return value = 4.1; }
  
  // Percentage Range: 3.1-4.0
  if (analogFC28 >= 163.8 && analogFC28 < 167.895) { return value = 4.0; } 
  else if (analogFC28 >= 159.705 && analogFC28 < 163.8) { return value = 3.9; }
  else if (analogFC28 >= 155.61 && analogFC28 < 159.705) { return value = 3.8; }
  else if (analogFC28 >= 151.515 && analogFC28 < 155.61) { return value = 3.7; }
  else if (analogFC28 >= 147.42 && analogFC28 < 151.515) { return value = 3.6; }
  else if (analogFC28 >= 143.325 && analogFC28 < 147.42) { return value = 3.5; }
  else if (analogFC28 >= 139.23 && analogFC28 < 143.325) { return value = 3.4; }
  else if (analogFC28 >= 135.135 && analogFC28 < 139.23) { return value = 3.3; }
  else if (analogFC28 >= 131.04 && analogFC28 < 135.135) { return value = 3.2; }
  else if (analogFC28 >= 126.945 && analogFC28 < 131.04) { return value = 3.1; }
  
  // Percentage Range: 2.1-3.0
  if (analogFC28 >= 122.85 && analogFC28 < 126.945) { return value = 3.0; }
  else if (analogFC28 >= 118.755 && analogFC28 < 122.85) { return value = 2.9; }
  else if (analogFC28 >= 114.66 && analogFC28 < 118.755) { return value = 2.8; }
  else if (analogFC28 >= 110.565 && analogFC28 < 114.66) { return value = 2.7; }
  else if (analogFC28 >= 106.47 && analogFC28 < 110.565) { return value = 2.6; }
  else if (analogFC28 >= 102.375 && analogFC28 < 106.47) { return value = 2.5; }
  else if (analogFC28 >= 98.28 && analogFC28 < 102.375) { return value = 2.4; }
  else if (analogFC28 >= 94.185 && analogFC28 < 98.28) { return value = 2.3; }
  else if (analogFC28 >= 90.09 && analogFC28 < 94.185) { return value = 2.2; }
  else if (analogFC28 >= 85.995 && analogFC28 < 90.09) { return value = 2.1; }
  
  // Percentage Range: 1.1-2.0
  if (analogFC28 >= 81.9 && analogFC28 < 85.995) { return value = 2.0; } 
  else if (analogFC28 >= 77.805 && analogFC28 < 81.9) { return value = 1.9; } 
  else if (analogFC28 >= 73.71 && analogFC28 < 77.805) { return value = 1.8; } 
  else if (analogFC28 >= 69.615 && analogFC28 < 73.71) { return value = 1.7; } 
  else if (analogFC28 >= 65.52 && analogFC28 < 69.615) { return value = 1.6; } 
  else if (analogFC28 >= 61.425 && analogFC28 < 65.52) { return value = 1.5; } 
  else if (analogFC28 >= 57.33 && analogFC28 < 61.425) { return value = 1.4; } 
  else if (analogFC28 >= 53.235 && analogFC28 < 57.33) { return value = 1.3; } 
  else if (analogFC28 >= 49.14 && analogFC28 < 53.235) { return value = 1.2; } 
  else if (analogFC28 >= 45.045 && analogFC28 < 49.14) { return value = 1.1; } 
  
  // Percentage Range: 0.0-1.0
  if (analogFC28 >= 40.95 && analogFC28 < 45.045) { return value = 1.0; }
  else if (analogFC28 >= 36.855 && analogFC28 < 40.95) { return value = 0.9; }
  else if (analogFC28 >= 32.76 && analogFC28 < 36.855) { return value = 0.8; }
  else if (analogFC28 >= 28.665 && analogFC28 < 32.76) { return value = 0.7; }
  else if (analogFC28 >= 24.57 && analogFC28 < 28.665) { return value = 0.6; }
  else if (analogFC28 >= 20.475 && analogFC28 < 24.57) { return value = 0.5; }
  else if (analogFC28 >= 16.38 && analogFC28 < 20.475) { return value = 0.4; }
  else if (analogFC28 >= 12.285 && analogFC28 < 16.38) { return value = 0.3; }
  else if (analogFC28 >= 8.19 && analogFC28 < 12.285) { return value = 0.2; }
  else if (analogFC28 >= 4.095 && analogFC28 < 8.19) { return value = 0.1; }
  else if (analogFC28 < 4.095) { return value = 0.0; }
}